-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/AAR001_3_cox_regression.log
  log type:  text
 opened on:  17 Feb 2021, 10:59:41

. 
. 
. 
. * Open dataset (complete case ethnicity)
. use "analysis/data_aranalysis_cohort`i'.dta", clear 
(Analysis dataset, wave 1 (1 Mar - 31 Aug 20), for absolute risk work)

. drop if ethnicity_5>=.
(0 observations deleted)

. 
. 
. * Keep under 50s only
. drop if age>=50
(252 observations deleted)

. 
. 
. 
. /*  Declare data to be survival  */
. 
. stset stime_`out'`i', fail(`out'`i') scale(365.25)

     failure event:  coviddeath1 != 0 & coviddeath1 < .
obs. time interval:  (0, stime_coviddeath1]
 exit on or before:  failure
    t for analysis:  time/365.25

------------------------------------------------------------------------------
        234  total observations
          0  exclusions
------------------------------------------------------------------------------
        234  observations remaining, representing
          3  failures in single-record/single-failure data
    113.273  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .5037645

. 
. 
.                 
. /*  Fit Cox models  */
.                         
. forvalues j = 0 (1) 1 {
  2.         capture erase coefs_cox_3_`j'.ster
  3. 
.         stcox           age1 age2 age3                                  ///
>                                 ib2.obesecat                                 
>    ///
>                                 i.smoke_nomiss                               
>    ///
>                                 i.ethnicity_5                                
>    ///
>                                 i.imd                                        
>            ///
>                                 i.respiratory                                
>    ///
>                                 i.cf                                         
>            ///
>                                 i.asthmacat                                  
>            ///
>                                 i.cardiac                                    
>            ///
>                                 i.hypertension                               
>    ///
>                                 i.diabcat                                    
>            ///
>                                 i.af                                         
>            ///
>                                 i.dvt_pe                                     
>            ///
>                                 i.pad                                        
>            ///
>                                 i.cancerExhaem                               
>    ///
>                                 i.cancerHaem                                 
>    ///
>                                 i.liver                                      
>            ///
>                                 i.stroke                                     
>            ///
>                                 i.dementia                                   
>            ///
>                                 i.tia                                        
>            ///
>                                 i.neuro                                      
>            ///
>                                 i.kidneyfn                                   
>            ///
>                                 i.transplant                                 
>    ///
>                                 i.dialysis                                   
>            ///
>                                 i.spleen                                     
>            ///
>                                 i.autoimmune                                 
>    ///
>                                 i.ibd                                        
>            ///
>                                 i.immunosuppression                          
>    ///
>                                 i.smi                                        
>            ///
>                                 i.ds                                         
>            ///
>                                 i.ldr                                        
>            ///
>                                 i.fracture                                   
>            ///
>                                 if male==`j'                                 
>    ///
>                                 , strata(stp)
  4.         estimates save coefs_cox_3_`j', replace
  5. }

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

note: 1.pad omitted because of collinearity
note: 4.cancerExhaem omitted because of collinearity
note: 4.cancerHaem omitted because of collinearity
note: 1.liver omitted because of collinearity
note: 1.stroke omitted because of collinearity
note: 0.dementia omitted because of collinearity
note: 1.tia omitted because of collinearity
note: 1.neuro omitted because of collinearity
note: 3.kidneyfn omitted because of collinearity
note: 1.transplant omitted because of collinearity
note: 0.dialysis omitted because of collinearity
note: 1.spleen omitted because of collinearity
note: 1.autoimmune omitted because of collinearity
note: 1.ibd omitted because of collinearity
note: 1.immunosuppression omitted because of collinearity
note: 1.smi omitted because of collinearity
note: 1.ds omitted because of collinearity
note: 1.ldr omitted because of collinearity
note: 0.fracture omitted because of collinearity
Iteration 0:   log likelihood =          0
Refining estimates:
Iteration 0:   log likelihood =          0

Stratified Cox regr. -- no ties

No. of subjects =           23                  Number of obs    =          23
No. of failures =            0
Time at risk    =  11.56468172
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
    obesecat |
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
             |
smoke_nomiss |
    Current  |          1  (omitted)
             |
 ethnicity_5 |
      Mixed  |          1  (omitted)
Asian or ..  |          1  (omitted)
      Black  |          1  (omitted)
      Other  |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
1.respirat~y |          1  (omitted)
        1.cf |          1  (omitted)
             |
   asthmacat |
Yes, no OCS  |          1  (omitted)
   1.cardiac |          1  (omitted)
1.hyperten~n |          1  (omitted)
             |
     diabcat |
Controlle..  |          1  (omitted)
Uncontrol..  |          1  (omitted)
             |
        1.af |          1  (omitted)
    1.dvt_pe |          1  (omitted)
       1.pad |          1  (omitted)
             |
cancerExhaem |
   5+ years  |          1  (omitted)
             |
  cancerHaem |
   5+ years  |          1  (omitted)
     1.liver |          1  (omitted)
    1.stroke |          1  (omitted)
  0.dementia |          1  (omitted)
       1.tia |          1  (omitted)
     1.neuro |          1  (omitted)
             |
    kidneyfn |
Stage 4/5..  |          1  (omitted)
1.transplant |          1  (omitted)
  0.dialysis |          1  (omitted)
    1.spleen |          1  (omitted)
1.autoimmune |          1  (omitted)
       1.ibd |          1  (omitted)
1.immunosu~n |          1  (omitted)
       1.smi |          1  (omitted)
        1.ds |          1  (omitted)
       1.ldr |          1  (omitted)
  0.fracture |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file coefs_cox_3_0.ster not found)
file coefs_cox_3_0.ster saved

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

note: 1.stroke omitted because of collinearity
note: 1.dementia omitted because of collinearity
note: 1.tia omitted because of collinearity
note: 1.neuro omitted because of collinearity
note: 3.kidneyfn omitted because of collinearity
note: 1.transplant omitted because of collinearity
note: 1.dialysis omitted because of collinearity
note: 1.spleen omitted because of collinearity
note: 1.autoimmune omitted because of collinearity
note: 1.ibd omitted because of collinearity
note: 1.immunosuppression omitted because of collinearity
note: 1.smi omitted because of collinearity
note: 1.ds omitted because of collinearity
note: 1.ldr omitted because of collinearity
note: 0.fracture omitted because of collinearity
Iteration 0:   log likelihood =          0
Refining estimates:
Iteration 0:   log likelihood =          0

Stratified Cox regr. -- no ties

No. of subjects =           30                  Number of obs    =          30
No. of failures =            0
Time at risk    =  14.42299795
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
    obesecat |
Underwei..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
             |
smoke_nomiss |
    Current  |          1  (omitted)
             |
 ethnicity_5 |
      Mixed  |          1  (omitted)
Asian or ..  |          1  (omitted)
      Black  |          1  (omitted)
      Other  |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
1.respirat~y |          1  (omitted)
        1.cf |          1  (omitted)
             |
   asthmacat |
Yes, no OCS  |          1  (omitted)
Yes with ..  |          1  (omitted)
             |
   1.cardiac |          1  (omitted)
1.hyperten~n |          1  (omitted)
             |
     diabcat |
Controlle..  |          1  (omitted)
        1.af |          1  (omitted)
    1.dvt_pe |          1  (omitted)
       1.pad |          1  (omitted)
             |
cancerExhaem |
2-5 years..  |          1  (omitted)
   5+ years  |          1  (omitted)
             |
  cancerHaem |
2-5 years..  |          1  (omitted)
   5+ years  |          1  (omitted)
             |
     1.liver |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
       1.tia |          1  (omitted)
     1.neuro |          1  (omitted)
             |
    kidneyfn |
Stage 4/5..  |          1  (omitted)
1.transplant |          1  (omitted)
  1.dialysis |          1  (omitted)
    1.spleen |          1  (omitted)
1.autoimmune |          1  (omitted)
       1.ibd |          1  (omitted)
1.immunosu~n |          1  (omitted)
       1.smi |          1  (omitted)
        1.ds |          1  (omitted)
       1.ldr |          1  (omitted)
  0.fracture |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file coefs_cox_3_1.ster not found)
file coefs_cox_3_1.ster saved

. 
. 
. 
. 
. *********************************************
. *  Read in estimates and format for tables  *
. *********************************************
. 
. * Read in programs to format output
. qui do "analysis/000_HR_table.do"

. 
. forvalues j = 0 (1) 1 {
  2.         * Cox model
.         crtablehr,      estimates(coefs_cox_3_`j')              ///
>                                 outputfile(output/hr_`out'_wave`i'_male`j'.tx
> t)
  3. }
(note: file output/hr_coviddeath_wave1_male0.txt not found)
(note: file output/hr_coviddeath_wave1_male1.txt not found)

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/AAR001_3_cox_regression.log
  log type:  text
 closed on:  17 Feb 2021, 10:59:42
-------------------------------------------------------------------------------
