-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/AAR001_2_cox_regression.log
  log type:  text
 opened on:  16 Feb 2021, 21:51:01

. 
. 
. 
. * Open dataset (complete case ethnicity)
. use "analysis/data_aranalysis_cohort`i'.dta", clear 
(Analysis dataset, wave 2 (1 Sept 20 - latest), for absolute risk work)

. drop if ethnicity_5>=.
(0 observations deleted)

. 
. 
. * Keep under 50s only
. drop if age>=50
(187 observations deleted)

. 
. 
. 
. /*  Declare data to be survival  */
. 
. stset stime_`out'`i', fail(`out'`i') scale(365.25)

     failure event:  covidadmission2 != 0 & covidadmission2 < .
obs. time interval:  (0, stime_covidadmission2]
 exit on or before:  failure
    t for analysis:  time/365.25

------------------------------------------------------------------------------
        235  total observations
         30  observations end on or before enter()
------------------------------------------------------------------------------
        205  observations remaining, representing
         15  failures in single-record/single-failure data
     66.899  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .3586585

. 
. 
.                 
. /*  Fit Cox models  */
.                         
. forvalues j = 0 (1) 1 {
  2.         capture erase coefs_cox_2_`j'.ster
  3. 
.         stcox           age1 age2 age3                                  ///
>                                 ib2.obesecat                                 
>    ///
>                                 i.smoke_nomiss                               
>    ///
>                                 i.ethnicity_5                                
>    ///
>                                 i.imd                                        
>            ///
>                                 i.respiratory                                
>    ///
>                                 i.cf                                         
>            ///
>                                 i.asthmacat                                  
>            ///
>                                 i.cardiac                                    
>            ///
>                                 i.hypertension                               
>    ///
>                                 i.diabcat                                    
>            ///
>                                 i.af                                         
>            ///
>                                 i.dvt_pe                                     
>            ///
>                                 i.pad                                        
>            ///
>                                 i.cancerExhaem                               
>    ///
>                                 i.cancerHaem                                 
>    ///
>                                 i.liver                                      
>            ///
>                                 i.stroke                                     
>            ///
>                                 i.dementia                                   
>            ///
>                                 i.tia                                        
>            ///
>                                 i.neuro                                      
>            ///
>                                 i.kidneyfn                                   
>            ///
>                                 i.transplant                                 
>    ///
>                                 i.dialysis                                   
>            ///
>                                 i.spleen                                     
>            ///
>                                 i.autoimmune                                 
>    ///
>                                 i.ibd                                        
>            ///
>                                 i.immunosuppression                          
>    ///
>                                 i.smi                                        
>            ///
>                                 i.ds                                         
>            ///
>                                 i.ldr                                        
>            ///
>                                 i.fracture                                   
>            ///
>                                 if male==`j'                                 
>    ///
>                                 , strata(stp)
  4.         estimates save coefs_cox_2_`j', replace
  5. }

         failure _d:  covidadmission2
   analysis time _t:  stime_covidadmission2/365.25

note: 1.af omitted because of collinearity
note: 1.dvt_pe omitted because of collinearity
note: 1.pad omitted because of collinearity
note: 4.cancerExhaem omitted because of collinearity
note: 1.cancerHaem omitted because of collinearity
note: 1.liver omitted because of collinearity
note: 1.stroke omitted because of collinearity
note: 1.dementia omitted because of collinearity
note: 1.tia omitted because of collinearity
note: 1.neuro omitted because of collinearity
note: 3.kidneyfn omitted because of collinearity
note: 1.transplant omitted because of collinearity
note: 1.dialysis omitted because of collinearity
note: 1.spleen omitted because of collinearity
note: 1.autoimmune omitted because of collinearity
note: 1.ibd omitted because of collinearity
note: 1.immunosuppression omitted because of collinearity
note: 1.smi omitted because of collinearity
note: 1.ds omitted because of collinearity
note: 1.ldr omitted because of collinearity
note: 0.fracture omitted because of collinearity
Iteration 0:   log likelihood = -.69314718
Iteration 1:   log likelihood = -.12692801
Iteration 2:   log likelihood = -.04256624
Iteration 3:   log likelihood = -.01520045
Iteration 4:   log likelihood = -.00553366
Iteration 5:   log likelihood = -.00202801
Iteration 6:   log likelihood = -.00074503
Iteration 7:   log likelihood = -.00027394
Iteration 8:   log likelihood = -.00010076
Iteration 9:   log likelihood = -.00003706
Iteration 10:  log likelihood = -.00001363
Iteration 11:  log likelihood = -5.016e-06
Iteration 12:  log likelihood = -1.845e-06
Iteration 13:  log likelihood = -6.788e-07
Iteration 14:  log likelihood = -2.497e-07
Iteration 15:  log likelihood = -9.187e-08
Iteration 16:  log likelihood = -3.380e-08
Iteration 17:  log likelihood = -1.243e-08
Iteration 18:  log likelihood = -4.574e-09
Iteration 19:  log likelihood = -1.683e-09
Iteration 20:  log likelihood = -6.190e-10
Iteration 21:  log likelihood = -2.277e-10
Iteration 22:  log likelihood = -8.377e-11
Iteration 23:  log likelihood = -3.082e-11
Iteration 24:  log likelihood = -1.134e-11
Iteration 25:  log likelihood = -4.164e-12
Iteration 26:  log likelihood = -1.535e-12
Iteration 27:  log likelihood = -5.684e-13
Iteration 28:  log likelihood = -2.132e-13
Iteration 29:  log likelihood = -7.105e-14
Iteration 30:  log likelihood = -2.842e-14
Iteration 31:  log likelihood = -1.421e-14
Iteration 32:  log likelihood =          0
Refining estimates:
Iteration 0:   log likelihood =          0
Iteration 1:   log likelihood =          0

Stratified Cox regr. -- no ties

No. of subjects =           22                  Number of obs    =          22
No. of failures =            1
Time at risk    =  7.244353183
                                                LR chi2(2)       =        1.39
Log likelihood  =            0                  Prob > chi2      =      0.5000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        age1 |   13.36347   3.85e+07     0.00   1.000            0           .
        age2 |   184.3437          .        .       .            .           .
        age3 |          1  (omitted)
             |
    obesecat |
Underwei..)  |          1  (omitted)
Obese I ..)  |   .3448627          .        .       .            .           .
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
             |
smoke_nomiss |
    Current  |          1  (omitted)
             |
 ethnicity_5 |
      Mixed  |          1  (omitted)
Asian or ..  |          1  (omitted)
      Black  |          1  (omitted)
      Other  |   659.5834   2.87e+10     0.00   1.000            0           .
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
1.respirat~y |          1  (omitted)
        1.cf |   .0046023          .        .       .            .           .
             |
   asthmacat |
Yes, no OCS  |   .0046023          .        .       .            .           .
   1.cardiac |          1  (omitted)
1.hyperten~n |          1  (omitted)
             |
     diabcat |
Controlle..  |          1  (omitted)
Uncontrol..  |          1  (omitted)
             |
        1.af |          1  (omitted)
    1.dvt_pe |          1  (omitted)
       1.pad |          1  (omitted)
             |
cancerExhaem |
   5+ years  |          1  (omitted)
             |
  cancerHaem |
      Never  |          1  (omitted)
     1.liver |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
       1.tia |          1  (omitted)
     1.neuro |          1  (omitted)
             |
    kidneyfn |
Stage 4/5..  |          1  (omitted)
1.transplant |          1  (omitted)
  1.dialysis |          1  (omitted)
    1.spleen |          1  (omitted)
1.autoimmune |          1  (omitted)
       1.ibd |          1  (omitted)
1.immunosu~n |          1  (omitted)
       1.smi |          1  (omitted)
        1.ds |          1  (omitted)
       1.ldr |          1  (omitted)
  0.fracture |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file coefs_cox_2_0.ster not found)
file coefs_cox_2_0.ster saved

         failure _d:  covidadmission2
   analysis time _t:  stime_covidadmission2/365.25

note: 1.respiratory omitted because of collinearity
note: 1.cf omitted because of collinearity
note: 2.asthmacat omitted because of collinearity
note: 1.cardiac omitted because of collinearity
note: 1.hypertension omitted because of collinearity
note: 2.diabcat omitted because of collinearity
note: 1.af omitted because of collinearity
note: 1.dvt_pe omitted because of collinearity
note: 1.pad omitted because of collinearity
note: 3.cancerExhaem omitted because of collinearity
note: 4.cancerExhaem omitted because of collinearity
note: 4.cancerHaem omitted because of collinearity
note: 1.liver omitted because of collinearity
note: 1.stroke omitted because of collinearity
note: 1.dementia omitted because of collinearity
note: 1.tia omitted because of collinearity
note: 1.neuro omitted because of collinearity
note: 3.kidneyfn omitted because of collinearity
note: 1.transplant omitted because of collinearity
note: 0.dialysis omitted because of collinearity
note: 1.spleen omitted because of collinearity
note: 1.autoimmune omitted because of collinearity
note: 1.ibd omitted because of collinearity
note: 1.immunosuppression omitted because of collinearity
note: 1.smi omitted because of collinearity
note: 1.ds omitted because of collinearity
note: 1.ldr omitted because of collinearity
note: 0.fracture omitted because of collinearity
Iteration 0:   log likelihood = -.69314718
Iteration 1:   log likelihood = -.12692801
Iteration 2:   log likelihood = -.04256624
Iteration 3:   log likelihood = -.01520045
Iteration 4:   log likelihood = -.00553366
Iteration 5:   log likelihood = -.00202801
Iteration 6:   log likelihood = -.00074503
Iteration 7:   log likelihood = -.00027394
Iteration 8:   log likelihood = -.00010076
Iteration 9:   log likelihood = -.00003706
Iteration 10:  log likelihood = -.00001363
Iteration 11:  log likelihood = -5.016e-06
Iteration 12:  log likelihood = -1.845e-06
Iteration 13:  log likelihood = -6.788e-07
Iteration 14:  log likelihood = -2.497e-07
Iteration 15:  log likelihood = -9.187e-08
Iteration 16:  log likelihood = -3.380e-08
Iteration 17:  log likelihood = -1.243e-08
Iteration 18:  log likelihood = -4.574e-09
Iteration 19:  log likelihood = -1.683e-09
Iteration 20:  log likelihood = -6.190e-10
Iteration 21:  log likelihood = -2.277e-10
Iteration 22:  log likelihood = -8.377e-11
Iteration 23:  log likelihood = -3.082e-11
Iteration 24:  log likelihood = -1.134e-11
Iteration 25:  log likelihood = -4.164e-12
Iteration 26:  log likelihood = -1.535e-12
Iteration 27:  log likelihood = -5.684e-13
Iteration 28:  log likelihood = -2.132e-13
Iteration 29:  log likelihood = -7.105e-14
Iteration 30:  log likelihood = -2.842e-14
Iteration 31:  log likelihood = -1.421e-14
Iteration 32:  log likelihood =          0
Refining estimates:
Iteration 0:   log likelihood =          0
Iteration 1:   log likelihood =          0

Stratified Cox regr. -- no ties

No. of subjects =           15                  Number of obs    =          15
No. of failures =            1
Time at risk    =   4.93908282
                                                LR chi2(2)       =        1.39
Log likelihood  =            0                  Prob > chi2      =      0.5000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        age1 |   .0019214          .        .       .            .           .
        age2 |   3.05e-09   .5300154    -0.00   1.000            0           .
        age3 |          1  (omitted)
             |
    obesecat |
Underwei..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |   243.6026          .        .       .            .           .
Obese II..)  |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |   1.557385          .        .       .            .           .
             |
 ethnicity_5 |
      Mixed  |   3.01e+08   4.51e+16     0.00   1.000            0           .
Asian or ..  |   1.557385          .        .       .            .           .
      Other  |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
1.respirat~y |          1  (omitted)
        1.cf |          1  (omitted)
             |
   asthmacat |
Yes, no OCS  |          1  (omitted)
   1.cardiac |          1  (omitted)
1.hyperten~n |          1  (omitted)
             |
     diabcat |
Controlle..  |          1  (omitted)
        1.af |          1  (omitted)
    1.dvt_pe |          1  (omitted)
       1.pad |          1  (omitted)
             |
cancerExhaem |
2-5 years..  |          1  (omitted)
   5+ years  |          1  (omitted)
             |
  cancerHaem |
   5+ years  |          1  (omitted)
     1.liver |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
       1.tia |          1  (omitted)
     1.neuro |          1  (omitted)
             |
    kidneyfn |
Stage 4/5..  |          1  (omitted)
1.transplant |          1  (omitted)
  0.dialysis |          1  (omitted)
    1.spleen |          1  (omitted)
1.autoimmune |          1  (omitted)
       1.ibd |          1  (omitted)
1.immunosu~n |          1  (omitted)
       1.smi |          1  (omitted)
        1.ds |          1  (omitted)
       1.ldr |          1  (omitted)
  0.fracture |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file coefs_cox_2_1.ster not found)
file coefs_cox_2_1.ster saved

. 
. 
. 
. 
. *********************************************
. *  Read in estimates and format for tables  *
. *********************************************
. 
. * Read in programs to format output
. qui do "analysis/000_HR_table.do"

. 
. forvalues j = 0 (1) 1 {
  2.         * Cox model
.         crtablehr,      estimates(coefs_cox_2_`j')              ///
>                                 outputfile(output/hr_`out'_wave`i'_male`j'.tx
> t)
  3. }
(note: file output/hr_covidadmission_wave2_male0.txt not found)
(note: file output/hr_covidadmission_wave2_male1.txt not found)

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/AAR001_2_cox_regression.log
  log type:  text
 closed on:  16 Feb 2021, 21:51:02
-------------------------------------------------------------------------------
