-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/AL004_3_cox_regression.log
  log type:  text
 opened on:  16 Feb 2021, 21:40:08

. 
. 
. * Categories of various exposures
. local lo_ldr            = 0

. local hi_ldr            = 1

. local lo_ldr_cat        = 0

. local hi_ldr_cat        = 2

. local hi_ldr            = 1

. local lo_ldr_carecat= 0

. local hi_ldr_carecat= 2

. local lo_ds             = 0

. local hi_ds             = 1

. local lo_cp             = 0

. local hi_cp             = 1

. local lo_ldr_group      = 0

. local hi_ldr_group      = 5

. 
. * Open temporary file to post results
. tempfile ldrfile

. tempname ldrresults

. 
. postfile `ldrresults'   wave str15(outcome) str15(exposure) str20(model)     
>    ///
>                                                 expcat lnhr sehr using `ldrfi
> le'

. 
. 
. * Open dataset (complete case ethnicity)
. use "analysis/data_ldanalysis_cohort`i'.dta", clear 
(Analysis dataset, wave 1 (1 Mar - 31 Aug 20), for learning disability work)

. drop if ethnicity_5>=.
(250 observations deleted)

. 
. * Only keep data for adults
. keep if child==0
(129 observations deleted)

. 
. /*  Declare data to be survival  */
. 
. stset stime_`out'`i', fail(`out'`i') scale(365.25)

     failure event:  coviddeath1 != 0 & coviddeath1 < .
obs. time interval:  (0, stime_coviddeath1]
 exit on or before:  failure
    t for analysis:  time/365.25

------------------------------------------------------------------------------
        621  total observations
          0  exclusions
------------------------------------------------------------------------------
        621  observations remaining, representing
          9  failures in single-record/single-failure data
    299.313  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .5037645

. 
. 
. /*  Obtain rates  */
.                         
. strate `exp',                                                                
>                            ///
>         output(analysis/data_temp_`i'_`out'_`exp', replace)     ///
>         per(10000)

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

Estimated rates (per 10000) and lower/upper bounds of 95% confidence intervals
(621 records included in the analysis)

  +------------------------------------------------------------------+
  |            ldr_group   D        Y      Rate     Lower      Upper |
  |------------------------------------------------------------------|
  | No DS, no CP, no LDR   3   0.0114   263.433    84.963    816.793 |
  |       DS but not LDR   2   0.0029   695.317   173.897   2780.182 |
  |           DS and LDR   0   0.0014     0.000         .          . |
  |       CP but not LDR   1   0.0038   264.885    37.313   1880.438 |
  |           CP and LDR   0   0.0022     0.000         .          . |
  |------------------------------------------------------------------|
  |  LD with no DS or CP   3   0.0082   364.012   117.402   1128.646 |
  +------------------------------------------------------------------+


.                 
.                 
. /*  Fit Cox models  */
.                         
. * Confounder only model
. stcox i.`exp' age1 age2 age3 male i.ethnicity_5,        ///
>         strata(stpcode) cluster(household_id) 

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

Iteration 0:   log pseudolikelihood = -26.797293
Iteration 1:   log pseudolikelihood = -18.983643
Iteration 2:   log pseudolikelihood = -17.542866
Iteration 3:   log pseudolikelihood = -17.284902
Iteration 4:   log pseudolikelihood =  -17.21505
Iteration 5:   log pseudolikelihood = -17.190077
Iteration 6:   log pseudolikelihood = -17.180935
Iteration 7:   log pseudolikelihood = -17.177578
Iteration 8:   log pseudolikelihood = -17.176344
Iteration 9:   log pseudolikelihood =  -17.17589
Iteration 10:  log pseudolikelihood = -17.175723
Iteration 11:  log pseudolikelihood = -17.175662
Iteration 12:  log pseudolikelihood = -17.175639
Iteration 13:  log pseudolikelihood = -17.175631
Iteration 14:  log pseudolikelihood = -17.175628
Iteration 15:  log pseudolikelihood = -17.175627
Iteration 16:  log pseudolikelihood = -17.175626
Iteration 17:  log pseudolikelihood = -17.175626
Iteration 18:  log pseudolikelihood = -17.175626
Iteration 19:  log pseudolikelihood = -17.175626
Iteration 20:  log pseudolikelihood = -17.175626
Iteration 21:  log pseudolikelihood = -17.175626
Iteration 22:  log pseudolikelihood = -17.175626
Iteration 23:  log pseudolikelihood = -17.175626
Iteration 24:  log pseudolikelihood = -17.175626
Iteration 25:  log pseudolikelihood = -17.175626
Iteration 26:  log pseudolikelihood = -17.175626
Iteration 27:  log pseudolikelihood = -17.175626
Iteration 28:  log pseudolikelihood = -17.175626
Iteration 29:  log pseudolikelihood = -17.175626
Iteration 30:  log pseudolikelihood = -17.175626
Iteration 31:  log pseudolikelihood = -17.175626
Iteration 32:  log pseudolikelihood = -17.175626
Iteration 33:  log pseudolikelihood = -17.175626
Iteration 34:  log pseudolikelihood = -17.175626
Iteration 35:  log pseudolikelihood = -17.175626
Refining estimates:
Iteration 0:   log pseudolikelihood = -17.175626
Iteration 1:   log pseudolikelihood = -17.175626
Iteration 2:   log pseudolikelihood = -17.175626
Iteration 3:   log pseudolikelihood = -17.175626

Stratified Cox regr. -- no ties

No. of subjects      =          621             Number of obs    =         621
No. of failures      =            9
Time at risk         =  299.3127995
                                                Wald chi2(13)    =    10044.88
Log pseudolikelihood =   -17.175626             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 428 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   ldr_group |
DS but no..  |   1.665887   1.862794     0.46   0.648     .1861369    14.90935
 DS and LDR  |   6.09e-17   6.20e-17   -36.63   0.000     8.25e-18    4.49e-16
CP but no..  |   1.088652   1.426902     0.06   0.948     .0834094      14.209
 CP and LDR  |   1.70e-17   1.52e-17   -43.10   0.000     2.93e-18    9.82e-17
LD with n..  |   2.767077   2.313331     1.22   0.223     .5375268    14.24434
             |
        age1 |    .699258   .0892925    -2.80   0.005     .5444304    .8981161
        age2 |   2.527937   .9040754     2.59   0.010     1.254145    5.095474
        age3 |   .0492737   .0605183    -2.45   0.014     .0044377    .5471007
        male |   .1659397    .096297    -3.10   0.002     .0532092    .5175042
             |
 ethnicity_5 |
      Mixed  |   2.457013   4.096837     0.54   0.590     .0935641    64.52169
Asian or ..  |   5.51e-17   7.04e-17   -29.31   0.000     4.51e-18    6.74e-16
      Black  |   4.004191   5.295827     1.05   0.294      .299737    53.49205
      Other  |   4.598559   6.452485     1.09   0.277     .2939375    71.94298
------------------------------------------------------------------------------
                                                         Stratified by stpcode

. forvalues k = `lo_`exp'' (1) `hi_`exp'' {
  2.         capture qui di _b[`k'.`exp']
  3.         if _rc==0 {
  4.                 post `ldrresults' (`i') ("`out'") ("`exp'")             //
> /
>                         ("Confounders")                                      
>                    ///
>                         (`k') (_b[`k'.`exp']) (_se[`k'.`exp'])
  5.         }
  6. }

. 
. 
. postclose `ldrresults'

. 
. use `ldrfile', clear

. 
. *************************
. *  Tidy output for HRs  *
. *************************
. 
. * Outcome
. rename outcome out

. gen outcome     = 1 if out=="coviddeath"

. replace outcome = 2 if out=="covidadmission"
(0 real changes made)

. replace outcome = 3 if out=="composite"
(0 real changes made)

. 
. label define outcome    1 "COVID-19 death"              ///
>                                                 2 "COVID-19 admission"  ///
>                                                 3 "Composite"

. label values outcome outcome

. drop out

. 
. * Exposure
. rename exposure exp

. gen     exposure = 1 if exp=="ldr"
(6 missing values generated)

. replace exposure = 2 if exp=="ldr_cat"
(0 real changes made)

. replace exposure = 3 if exp=="ldr_carecat"
(0 real changes made)

. replace exposure = 4 if exp=="ds"
(0 real changes made)

. replace exposure = 5 if exp=="cp"
(0 real changes made)

. replace exposure = 6 if exp=="ldr_group"
(6 real changes made)

. 
. label define exposure   1 "Learning disability register"        ///
>                                                 2 "LDR Severe vs mild"       
>                    ///
>                                                 3 "LDR by residential care"  
>                    ///
>                                                 4 "Down's syndrome"          
>                            ///
>                                                 5 "Cerebral Palsy"           
>                            ///
>                                                 6 "Combined grouping"        
>                    

. label values exposure exposure                                          

. drop exp

. 
. * Categories of exposure
. gen category     = "No"                                         if expcat==0
(5 missing values generated)

. replace category = "Yes"                                        if inlist(exp
> osure, 1, 4, 5) & expcat==1
(0 real changes made)

. 
. replace category = "LDR, mild"                          if inlist(exposure, 2
> ) & expcat==1
(0 real changes made)

. replace category = "LDR, profound"                      if inlist(exposure, 2
> ) & expcat==2
(0 real changes made)

. 
. replace category = "LDR, community"             if inlist(exposure, 3) & expc
> at==1
(0 real changes made)

. replace category = "LDR, residential care"      if inlist(exposure, 3) & expc
> at==2
(0 real changes made)

. 
. replace category = "DS but not LDR"             if inlist(exposure, 6) & expc
> at==1
variable category was str2 now str14
(1 real change made)

. replace category = "DS and LDR"                         if inlist(exposure, 6
> ) & expcat==2
(1 real change made)

. replace category = "CP but not LDR"             if inlist(exposure, 6) & expc
> at==3
(1 real change made)

. replace category = "CP and LDR"                         if inlist(exposure, 6
> ) & expcat==4
(1 real change made)

. replace category = "LDR with no DS or CP"       if inlist(exposure, 6) & expc
> at==5
variable category was str14 now str20
(1 real change made)

. 
. * Model adjustment
. gen     adjustment = 1 if model=="Confounders"

. replace adjustment = 2 if model=="Confounders+IMD"
(0 real changes made)

. replace adjustment = 3 if model=="Confounders+Resid"
(0 real changes made)

. replace adjustment = 4 if model=="Confounders_Comorb"
(0 real changes made)

. label define adj        1 "Confounders"                         ///     
>                                         2 "Confounders with IMD"        ///
>                                         3 "Confounders with care"       ///
>                                         4 "Confounders with comorbidities"   
>    

. label values adjustment adj

. drop model

. 
. * Hazard ratio with 95% confidence interval
. gen cl = exp(lnhr - invnorm(0.975)*sehr)

. gen cu = exp(lnhr + invnorm(0.975)*sehr)

. gen hr = exp(lnhr)

. 
. gen hr_ci =   string(round(hr, 0.01)) + " (" ///
>                         + string(round(cl, 0.01)) + ", " ///
>                         + string(round(cu, 0.01)) + ")"

. replace hr_ci = "" if expcat==0
(1 real change made)

. drop cl cu hr lnhr sehr

. 
. * Put in wide format
. reshape wide hr_ci, i(wave outcome exposure expcat) j(adjust)
(note: j = 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        6   ->       6
Number of variables                   7   ->       6
j variable (1 values)        adjustment   ->   (dropped)
xij variables:
                                  hr_ci   ->   hr_ci1
-----------------------------------------------------------------------------

. rename hr_ci1 hr_conf

. 
. order wave outcome exposure category hr*

. sort wave outcome exposure expcat

. 
. * Save data
. outsheet using "output/output_hrs_main_`i'_`out'_`exp'", replace
(note: file output/output_hrs_main_1_coviddeath_ldr_group.out not found)

. 
. 
. 
. ***************************
. *  Tidy output for rates  *
. ***************************
. 
. use "analysis/data_temp_`i'_`out'_`exp'", clear
(Analysis dataset, wave 1 (1 Mar - 31 Aug 20), for learning disability work)

. gen out  = "`out'"

. gen exp  = "`exp'" 

. gen wave = `i'

. 
. * Outcome
. gen outcome     = 1 if out=="coviddeath"

. replace outcome = 2 if out=="covidadmission"
(0 real changes made)

. replace outcome = 3 if out=="composite"
(0 real changes made)

. 
. label define outcome    1 "COVID-19 death"              ///
>                                                 2 "COVID-19 admission"  ///
>                                                 3 "Composite"

. label values outcome outcome

. drop out

. 
. * Exposure
. gen     exposure = 1 if exp=="ldr"
(6 missing values generated)

. replace exposure = 2 if exp=="ldr_cat"
(0 real changes made)

. replace exposure = 3 if exp=="ldr_carecat"
(0 real changes made)

. replace exposure = 4 if exp=="ds"
(0 real changes made)

. replace exposure = 5 if exp=="cp"
(0 real changes made)

. replace exposure = 6 if exp=="ldr_group"
(6 real changes made)

. 
. label define exposure   1 "Learning disability register"        ///
>                                                 2 "LDR Severe vs mild"       
>                    ///
>                                                 3 "LDR by residential care"  
>                    ///
>                                                 4 "Down's syndrome"          
>                            ///
>                                                 5 "Cerebral Palsy"           
>                            ///
>                                                 6 "Combined grouping"        
>                    

. label values exposure exposure                                          

. drop exp

. 
. * Categories of exposure
. rename ldr_group expcat

. gen category     = "No"                                         if expcat==0
(5 missing values generated)

. replace category = "Yes"                                        if inlist(exp
> osure, 1, 4, 5) & expcat==1
(0 real changes made)

. 
. replace category = "LDR, mild"                          if inlist(exposure, 2
> ) & expcat==1
(0 real changes made)

. replace category = "LDR, profound"                      if inlist(exposure, 2
> ) & expcat==2
(0 real changes made)

. 
. replace category = "LDR, community"             if inlist(exposure, 3) & expc
> at==1
(0 real changes made)

. replace category = "LDR, residential care"      if inlist(exposure, 3) & expc
> at==2
(0 real changes made)

. 
. replace category = "DS but not LDR"             if inlist(exposure, 6) & expc
> at==1
variable category was str2 now str14
(1 real change made)

. replace category = "DS and LDR"                         if inlist(exposure, 6
> ) & expcat==2
(1 real change made)

. replace category = "CP but not LDR"             if inlist(exposure, 6) & expc
> at==3
(1 real change made)

. replace category = "CP and LDR"                         if inlist(exposure, 6
> ) & expcat==4
(1 real change made)

. replace category = "LDR with no DS or CP"       if inlist(exposure, 6) & expc
> at==5
variable category was str14 now str20
(1 real change made)

. 
. * Rename remaining variables
. rename _D events

. rename _Y pyr_10000

. rename _Rate rate_per_10000

. rename _Lower rate_cl

. rename _Upper rate_cu

. 
. order wave outcome exposure category events pyr rate*

. sort wave outcome exposure expcat

. 
. 
. * Save data
. outsheet using "output/output_rates_`i'_`out'_`exp'", replace
(note: file output/output_rates_1_coviddeath_ldr_group.out not found)

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/AL004_3_cox_regression.log
  log type:  text
 closed on:  16 Feb 2021, 21:40:08
-------------------------------------------------------------------------------
