-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/AL004_4_cox_regression.log
  log type:  text
 opened on:  17 Feb 2021, 10:59:00

. 
. 
. * Categories of various exposures
. local lo_ldr            = 0

. local hi_ldr            = 1

. local lo_ldr_cat        = 0

. local hi_ldr_cat        = 2

. local hi_ldr            = 1

. local lo_ldr_carecat= 0

. local hi_ldr_carecat= 2

. local lo_ds             = 0

. local hi_ds             = 1

. local lo_cp             = 0

. local hi_cp             = 1

. local lo_ldr_group      = 0

. local hi_ldr_group      = 5

. 
. * Open temporary file to post results
. tempfile ldrfile

. tempname ldrresults

. 
. postfile `ldrresults'   wave str15(outcome) str15(exposure) str20(model)     
>    ///
>                                                 expcat lnhr sehr using `ldrfi
> le'

. 
. 
. * Open dataset (complete case ethnicity)
. use "analysis/data_ldanalysis_cohort`i'.dta", clear 
(Analysis dataset, wave 1 (1 Mar - 31 Aug 20), for learning disability work)

. drop if ethnicity_5>=.
(250 observations deleted)

. 
. * Only keep data for adults
. keep if child==0
(129 observations deleted)

. 
. /*  Declare data to be survival  */
. 
. stset stime_`out'`i', fail(`out'`i') scale(365.25)

     failure event:  covidadmission1 != 0 & covidadmission1 < .
obs. time interval:  (0, stime_covidadmission1]
 exit on or before:  failure
    t for analysis:  time/365.25

------------------------------------------------------------------------------
        621  total observations
          0  exclusions
------------------------------------------------------------------------------
        621  observations remaining, representing
         54  failures in single-record/single-failure data
    284.715  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .5037645

. 
. 
. /*  Obtain rates  */
.                         
. strate `exp',                                                                
>                            ///
>         output(analysis/data_temp_`i'_`out'_`exp', replace)     ///
>         per(10000)

         failure _d:  covidadmission1
   analysis time _t:  stime_covidadmission1/365.25

Estimated rates (per 10000) and lower/upper bounds of 95% confidence intervals
(621 records included in the analysis)

  +------------------------------------------------------------------+
  |            ldr_group    D        Y      Rate     Lower     Upper |
  |------------------------------------------------------------------|
  | No DS, no CP, no LDR   21   0.0108   1938.50   1263.92   2973.12 |
  |       DS but not LDR    5   0.0027   1820.24    757.64   4373.19 |
  |           DS and LDR    3   0.0014   2193.25    707.37   6800.34 |
  |       CP but not LDR    6   0.0036   1651.35    741.88   3675.69 |
  |           CP and LDR    5   0.0021   2436.62   1014.19   5854.06 |
  |------------------------------------------------------------------|
  |  LD with no DS or CP   14   0.0078   1786.13   1057.84   3015.82 |
  +------------------------------------------------------------------+


.                 
.                 
. /*  Fit Cox models  */
.                         
. * Confounder only model
. stcox i.`exp' age1 age2 age3 male i.ethnicity_5,        ///
>         strata(stpcode) cluster(household_id) 

         failure _d:  covidadmission1
   analysis time _t:  stime_covidadmission1/365.25

Iteration 0:   log pseudolikelihood = -160.17642
Iteration 1:   log pseudolikelihood = -155.73499
Iteration 2:   log pseudolikelihood = -155.64813
Iteration 3:   log pseudolikelihood = -155.64806
Refining estimates:
Iteration 0:   log pseudolikelihood = -155.64806

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          621             Number of obs    =         621
No. of failures      =           54
Time at risk         =  284.7145791
                                                Wald chi2(13)    =       13.69
Log pseudolikelihood =   -155.64806             Prob > chi2      =      0.3959

                         (Std. Err. adjusted for 428 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   ldr_group |
DS but no..  |   1.078547   .5042984     0.16   0.872     .4313612    2.696728
 DS and LDR  |   1.043923   .6330998     0.07   0.943     .3180143     3.42681
CP but no..  |   .9255264    .410136    -0.17   0.861     .3883193    2.205914
 CP and LDR  |   1.216171   .6181291     0.39   0.700     .4491223    3.293252
LD with n..  |   .8768445   .3221225    -0.36   0.721     .4267961     1.80146
             |
        age1 |   .9913671   .0610339    -0.14   0.888     .8786784    1.118508
        age2 |   .9818866   .1435205    -0.13   0.900     .7372976    1.307615
        age3 |   1.127026   .4695371     0.29   0.774     .4980919    2.550105
        male |   .8276914   .2290439    -0.68   0.494     .4811924    1.423699
             |
 ethnicity_5 |
      Mixed  |   1.201575   .5773478     0.38   0.702     .4685487    3.081391
Asian or ..  |   1.677908    .786742     1.10   0.270     .6693518    4.206122
      Black  |   .6385082   .3190647    -0.90   0.369     .2397829    1.700258
      Other  |   1.886029    .824931     1.45   0.147     .8002781    4.444836
------------------------------------------------------------------------------
                                                         Stratified by stpcode

. forvalues k = `lo_`exp'' (1) `hi_`exp'' {
  2.         capture qui di _b[`k'.`exp']
  3.         if _rc==0 {
  4.                 post `ldrresults' (`i') ("`out'") ("`exp'")             //
> /
>                         ("Confounders")                                      
>                    ///
>                         (`k') (_b[`k'.`exp']) (_se[`k'.`exp'])
  5.         }
  6. }

. 
. 
. postclose `ldrresults'

. 
. use `ldrfile', clear

. 
. *************************
. *  Tidy output for HRs  *
. *************************
. 
. * Outcome
. rename outcome out

. gen outcome     = 1 if out=="coviddeath"
(6 missing values generated)

. replace outcome = 2 if out=="covidadmission"
(6 real changes made)

. replace outcome = 3 if out=="composite"
(0 real changes made)

. 
. label define outcome    1 "COVID-19 death"              ///
>                                                 2 "COVID-19 admission"  ///
>                                                 3 "Composite"

. label values outcome outcome

. drop out

. 
. * Exposure
. rename exposure exp

. gen     exposure = 1 if exp=="ldr"
(6 missing values generated)

. replace exposure = 2 if exp=="ldr_cat"
(0 real changes made)

. replace exposure = 3 if exp=="ldr_carecat"
(0 real changes made)

. replace exposure = 4 if exp=="ds"
(0 real changes made)

. replace exposure = 5 if exp=="cp"
(0 real changes made)

. replace exposure = 6 if exp=="ldr_group"
(6 real changes made)

. 
. label define exposure   1 "Learning disability register"        ///
>                                                 2 "LDR Severe vs mild"       
>                    ///
>                                                 3 "LDR by residential care"  
>                    ///
>                                                 4 "Down's syndrome"          
>                            ///
>                                                 5 "Cerebral Palsy"           
>                            ///
>                                                 6 "Combined grouping"        
>                    

. label values exposure exposure                                          

. drop exp

. 
. * Categories of exposure
. gen category     = "No"                                         if expcat==0
(5 missing values generated)

. replace category = "Yes"                                        if inlist(exp
> osure, 1, 4, 5) & expcat==1
(0 real changes made)

. 
. replace category = "LDR, mild"                          if inlist(exposure, 2
> ) & expcat==1
(0 real changes made)

. replace category = "LDR, profound"                      if inlist(exposure, 2
> ) & expcat==2
(0 real changes made)

. 
. replace category = "LDR, community"             if inlist(exposure, 3) & expc
> at==1
(0 real changes made)

. replace category = "LDR, residential care"      if inlist(exposure, 3) & expc
> at==2
(0 real changes made)

. 
. replace category = "DS but not LDR"             if inlist(exposure, 6) & expc
> at==1
variable category was str2 now str14
(1 real change made)

. replace category = "DS and LDR"                         if inlist(exposure, 6
> ) & expcat==2
(1 real change made)

. replace category = "CP but not LDR"             if inlist(exposure, 6) & expc
> at==3
(1 real change made)

. replace category = "CP and LDR"                         if inlist(exposure, 6
> ) & expcat==4
(1 real change made)

. replace category = "LDR with no DS or CP"       if inlist(exposure, 6) & expc
> at==5
variable category was str14 now str20
(1 real change made)

. 
. * Model adjustment
. gen     adjustment = 1 if model=="Confounders"

. replace adjustment = 2 if model=="Confounders+IMD"
(0 real changes made)

. replace adjustment = 3 if model=="Confounders+Resid"
(0 real changes made)

. replace adjustment = 4 if model=="Confounders_Comorb"
(0 real changes made)

. label define adj        1 "Confounders"                         ///     
>                                         2 "Confounders with IMD"        ///
>                                         3 "Confounders with care"       ///
>                                         4 "Confounders with comorbidities"   
>    

. label values adjustment adj

. drop model

. 
. * Hazard ratio with 95% confidence interval
. gen cl = exp(lnhr - invnorm(0.975)*sehr)

. gen cu = exp(lnhr + invnorm(0.975)*sehr)

. gen hr = exp(lnhr)

. 
. gen hr_ci =   string(round(hr, 0.01)) + " (" ///
>                         + string(round(cl, 0.01)) + ", " ///
>                         + string(round(cu, 0.01)) + ")"

. replace hr_ci = "" if expcat==0
(1 real change made)

. drop cl cu hr lnhr sehr

. 
. * Put in wide format
. reshape wide hr_ci, i(wave outcome exposure expcat) j(adjust)
(note: j = 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        6   ->       6
Number of variables                   7   ->       6
j variable (1 values)        adjustment   ->   (dropped)
xij variables:
                                  hr_ci   ->   hr_ci1
-----------------------------------------------------------------------------

. rename hr_ci1 hr_conf

. 
. order wave outcome exposure category hr*

. sort wave outcome exposure expcat

. 
. * Save data
. outsheet using "output/output_hrs_main_`i'_`out'_`exp'", replace
(note: file output/output_hrs_main_1_covidadmission_ldr_group.out not found)

. 
. 
. 
. ***************************
. *  Tidy output for rates  *
. ***************************
. 
. use "analysis/data_temp_`i'_`out'_`exp'", clear
(Analysis dataset, wave 1 (1 Mar - 31 Aug 20), for learning disability work)

. gen out  = "`out'"

. gen exp  = "`exp'" 

. gen wave = `i'

. 
. * Outcome
. gen outcome     = 1 if out=="coviddeath"
(6 missing values generated)

. replace outcome = 2 if out=="covidadmission"
(6 real changes made)

. replace outcome = 3 if out=="composite"
(0 real changes made)

. 
. label define outcome    1 "COVID-19 death"              ///
>                                                 2 "COVID-19 admission"  ///
>                                                 3 "Composite"

. label values outcome outcome

. drop out

. 
. * Exposure
. gen     exposure = 1 if exp=="ldr"
(6 missing values generated)

. replace exposure = 2 if exp=="ldr_cat"
(0 real changes made)

. replace exposure = 3 if exp=="ldr_carecat"
(0 real changes made)

. replace exposure = 4 if exp=="ds"
(0 real changes made)

. replace exposure = 5 if exp=="cp"
(0 real changes made)

. replace exposure = 6 if exp=="ldr_group"
(6 real changes made)

. 
. label define exposure   1 "Learning disability register"        ///
>                                                 2 "LDR Severe vs mild"       
>                    ///
>                                                 3 "LDR by residential care"  
>                    ///
>                                                 4 "Down's syndrome"          
>                            ///
>                                                 5 "Cerebral Palsy"           
>                            ///
>                                                 6 "Combined grouping"        
>                    

. label values exposure exposure                                          

. drop exp

. 
. * Categories of exposure
. rename ldr_group expcat

. gen category     = "No"                                         if expcat==0
(5 missing values generated)

. replace category = "Yes"                                        if inlist(exp
> osure, 1, 4, 5) & expcat==1
(0 real changes made)

. 
. replace category = "LDR, mild"                          if inlist(exposure, 2
> ) & expcat==1
(0 real changes made)

. replace category = "LDR, profound"                      if inlist(exposure, 2
> ) & expcat==2
(0 real changes made)

. 
. replace category = "LDR, community"             if inlist(exposure, 3) & expc
> at==1
(0 real changes made)

. replace category = "LDR, residential care"      if inlist(exposure, 3) & expc
> at==2
(0 real changes made)

. 
. replace category = "DS but not LDR"             if inlist(exposure, 6) & expc
> at==1
variable category was str2 now str14
(1 real change made)

. replace category = "DS and LDR"                         if inlist(exposure, 6
> ) & expcat==2
(1 real change made)

. replace category = "CP but not LDR"             if inlist(exposure, 6) & expc
> at==3
(1 real change made)

. replace category = "CP and LDR"                         if inlist(exposure, 6
> ) & expcat==4
(1 real change made)

. replace category = "LDR with no DS or CP"       if inlist(exposure, 6) & expc
> at==5
variable category was str14 now str20
(1 real change made)

. 
. * Rename remaining variables
. rename _D events

. rename _Y pyr_10000

. rename _Rate rate_per_10000

. rename _Lower rate_cl

. rename _Upper rate_cu

. 
. order wave outcome exposure category events pyr rate*

. sort wave outcome exposure expcat

. 
. 
. * Save data
. outsheet using "output/output_rates_`i'_`out'_`exp'", replace
(note: file output/output_rates_1_covidadmission_ldr_group.out not found)

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/AL004_4_cox_regression.log
  log type:  text
 closed on:  17 Feb 2021, 10:59:00
-------------------------------------------------------------------------------
