-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/AL006_cox_regression_inter_wave1_coviddeath_ds.log
  log type:  text
 opened on:  25 Feb 2021, 20:20:31

. 
. 
. * Categories of various exposures
. local lo_ldr            = 0

. local hi_ldr            = 1

. local lo_ldr_cat        = 0

. local hi_ldr_cat        = 2

. local hi_ldr            = 1

. local lo_ldr_carecat= 0

. local hi_ldr_carecat= 2

. local lo_ds             = 0

. local hi_ds             = 1

. local lo_cp             = 0

. local hi_cp             = 1

. local lo_ldr_group      = 0

. local hi_ldr_group      = 5

. 
. * Open temporary file to post results
. tempfile ldrfile

. tempname ldrresults

. 
. postfile `ldrresults'   wave str15(outcome) str15(exposure) str20(model)     
>    ///
>                                                 expcat agebroad lnhr sehr usi
> ng `ldrfile'

. 
. 
.         * Open dataset (complete case ethnicity)
.         use "analysis/data_ldanalysis_cohort`i'.dta", clear 
(Analysis dataset, wave 1 (1 Mar - 31 Aug 20), for learning disability work)

.         drop if ethnicity_5>=.
(12,499 observations deleted)

. 
.         * Only keep data for adults
.         keep if child==0
(7,126 observations deleted)

. 
.         
.         /*  Declare data to be survival  */
. 
.         stset stime_`out'`i', fail(`out'`i') scale(365.25)

     failure event:  coviddeath1 != 0 & coviddeath1 < .
obs. time interval:  (0, stime_coviddeath1]
 exit on or before:  failure
    t for analysis:  time/365.25

------------------------------------------------------------------------------
     30,365  total observations
          0  exclusions
------------------------------------------------------------------------------
     30,365  observations remaining, representing
        648  failures in single-record/single-failure data
 14,525.018  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .5037645

. 
.         
.                 
.         /*  Fit Cox models  */
.         
.         * Confounder only model
.         stcox i.`exp'##i.agebroad age1 age2 age3 male i.ethnicity_5,    ///
>                 strata(stpcode) cluster(household_id) 

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

Iteration 0:   log pseudolikelihood = -4435.1167
Iteration 1:   log pseudolikelihood = -4432.3639
Iteration 2:   log pseudolikelihood = -4432.3563
Iteration 3:   log pseudolikelihood = -4432.3563
Refining estimates:
Iteration 0:   log pseudolikelihood = -4432.3563

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,365             Number of obs    =      30,365
No. of failures      =          648
Time at risk         =  14525.01848
                                                Wald chi2(13)    =        5.85
Log pseudolikelihood =   -4432.3563             Prob > chi2      =      0.9516

                       (Std. Err. adjusted for 1,207 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        1.ds |   .9313542   .1074002    -0.62   0.537     .7429466    1.167541
             |
    agebroad |
     65-<75  |   .8662197   .1837675    -0.68   0.498       .57154    1.312833
        75+  |   .8723222   .3504704    -0.34   0.734     .3969101    1.917175
             |
 ds#agebroad |
   1#65-<75  |   1.345377   .4005402     1.00   0.319     .7506328     2.41135
      1#75+  |   .8546055   .2951628    -0.45   0.649     .4342887    1.681717
             |
        age1 |   .9996212    .024152    -0.02   0.987     .9533875    1.048097
        age2 |   1.004888   .0604898     0.08   0.935     .8930573    1.130723
        age3 |   .9893661    .156723    -0.07   0.946     .7253044    1.349565
        male |   .9347977   .0712705    -0.88   0.377     .8050458    1.085462
             |
 ethnicity_5 |
      Mixed  |   1.191914    .149984     1.40   0.163     .9313956    1.525301
Asian or ..  |   1.185298   .1478153     1.36   0.173      .928275    1.513487
      Black  |   1.107661    .143467     0.79   0.430     .8593246    1.427765
      Other  |   1.123176   .1459478     0.89   0.371     .8706445    1.448954
------------------------------------------------------------------------------
                                                         Stratified by stpcode

.         forvalues k = `lo_`exp'' (1) `hi_`exp'' {
  2.                 capture qui di _b[`k'.`exp']
  3.                 if _rc==0 {
  4.                         post `ldrresults' (`i') ("`out'") ("`exp'")       
>       ///
>                                 ("Confounders")                              
>                            ///
>                                 (`k') (1) (_b[`k'.`exp']) (_se[`k'.`exp'])
  5.                 }
  6.                 forvalues l = 2 (1) 3 {
  7.                         capture qui di _b[`k'.`exp'#`l'.agebroad]
  8.                         if _rc==0 {
  9.                             lincom `k'.`exp' + `k'.`exp'#`l'.agebroad
 10.                                 post `ldrresults' (`i') ("`out'") ("`exp'"
> )             ///
>                                         ("Confounders")                      
>                                    ///
>                                         (`k') (`l') (r(estimate)) (r(se))
 11.                         }
 12.                 }
 13.         }

 ( 1)  0b.ds + 0b.ds#2o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.ds + 0b.ds#3o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#2.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2255584   .2755787     0.82   0.413    -.3145658    .7656827
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#3.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.228231   .3258339    -0.70   0.484    -.8668538    .4103918
------------------------------------------------------------------------------

.         
.         * Confounders with deprivation
.         stcox i.`exp'##i.agebroad age1 age2 age3 male i.ethnicity_5 imd, ///
>                 strata(stpcode) cluster(household_id) 

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

Iteration 0:   log pseudolikelihood = -4435.1167
Iteration 1:   log pseudolikelihood = -4431.6834
Iteration 2:   log pseudolikelihood = -4431.6758
Iteration 3:   log pseudolikelihood = -4431.6758
Refining estimates:
Iteration 0:   log pseudolikelihood = -4431.6758

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,365             Number of obs    =      30,365
No. of failures      =          648
Time at risk         =  14525.01848
                                                Wald chi2(14)    =        7.91
Log pseudolikelihood =   -4431.6758             Prob > chi2      =      0.8938

                       (Std. Err. adjusted for 1,207 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        1.ds |   .9323533   .1075526    -0.61   0.544     .7436853    1.168885
             |
    agebroad |
     65-<75  |   .8657412   .1837651    -0.68   0.497     .5710961    1.312402
        75+  |   .8707193   .3501457    -0.34   0.731     .3958961    1.915028
             |
 ds#agebroad |
   1#65-<75  |   1.346266   .4007755     1.00   0.318     .7511609     2.41284
      1#75+  |   .8582273    .296293    -0.44   0.658     .4362494    1.688379
             |
        age1 |      .9996   .0241504    -0.02   0.987     .9533694    1.048072
        age2 |    1.00488   .0604918     0.08   0.936     .8930454     1.13072
        age3 |   .9895948   .1568073    -0.07   0.947      .725403    1.350005
        male |   .9349031   .0712895    -0.88   0.377     .8051182    1.085609
             |
 ethnicity_5 |
      Mixed  |   1.191218   .1499427     1.39   0.164     .9307812    1.524526
Asian or ..  |   1.184088     .14773     1.35   0.176     .9272266    1.512106
      Black  |   1.106834   .1433382     0.78   0.433     .8587153    1.426644
      Other  |   1.123012   .1459569     0.89   0.372     .8704711    1.448819
             |
         imd |   .9680754   .0270852    -1.16   0.246     .9164187    1.022644
------------------------------------------------------------------------------
                                                         Stratified by stpcode

.         forvalues k = `lo_`exp'' (1) `hi_`exp'' {
  2.                 capture qui di _b[`k'.`exp']
  3.                 if _rc==0 {
  4.                         post `ldrresults' (`i') ("`out'") ("`exp'")     //
> /
>                                 ("Confounders+IMD")                          
>                    ///
>                                 (`k') (1) (_b[`k'.`exp']) (_se[`k'.`exp'])
  5.                 }       
  6.                 forvalues l = 2 (1) 3 {
  7.                         capture qui di _b[`k'.`exp'#`l'.agebroad]
  8.                         if _rc==0 {
  9.                             lincom `k'.`exp' + `k'.`exp'#`l'.agebroad
 10.                                 post `ldrresults' (`i') ("`out'") ("`exp'"
> )             ///
>                                         ("Confounders+IMD")                  
>                            ///
>                                         (`k') (`l') (r(estimate)) (r(se))
 11.                         }
 12.                 }
 13.         }

 ( 1)  0b.ds + 0b.ds#2o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.ds + 0b.ds#3o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#2.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2272911   .2755326     0.82   0.409    -.3127428     .767325
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#3.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2229297   .3257781    -0.68   0.494    -.8614429    .4155836
------------------------------------------------------------------------------

.         
.         * Confounders with residential care
.         stcox i.`exp'##i.agebroad age1 age2 age3 male   ///
>                                 i.ethnicity_5 resid_care_ldr,           ///
>                 strata(stpcode) cluster(household_id) 

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

Iteration 0:   log pseudolikelihood = -4435.1167
Iteration 1:   log pseudolikelihood = -4432.3309
Iteration 2:   log pseudolikelihood = -4432.3233
Iteration 3:   log pseudolikelihood = -4432.3233
Refining estimates:
Iteration 0:   log pseudolikelihood = -4432.3233

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,365             Number of obs    =      30,365
No. of failures      =          648
Time at risk         =  14525.01848
                                                Wald chi2(14)    =        5.88
Log pseudolikelihood =   -4432.3233             Prob > chi2      =      0.9694

                       (Std. Err. adjusted for 1,207 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        1.ds |   .9314876    .107418    -0.62   0.538     .7430492    1.167714
             |
    agebroad |
     65-<75  |   .8667079   .1838528    -0.67   0.500     .5718858    1.313518
        75+  |   .8727195   .3504864    -0.34   0.735      .397219     1.91743
             |
 ds#agebroad |
   1#65-<75  |    1.34443   .4004281     0.99   0.320     .7499193     2.41025
      1#75+  |   .8543869   .2951003    -0.46   0.649     .4341646    1.681337
             |
        age1 |   .9995993   .0241543    -0.02   0.987     .9533614     1.04808
        age2 |   1.004948   .0604988     0.08   0.935     .8931012    1.130803
        age3 |   .9891929   .1567033    -0.07   0.945     .7251664    1.349349
        male |   .9348475   .0712699    -0.88   0.377     .8050961     1.08551
             |
 ethnicity_5 |
      Mixed  |   1.191871   .1499784     1.39   0.163     .9313626    1.525245
Asian or ..  |   1.185727   .1479015     1.37   0.172     .9285604    1.514116
      Black  |   1.107768   .1434882     0.79   0.429      .859396    1.427921
      Other  |   1.123318   .1459846     0.89   0.371     .8707272    1.449184
             |
resid_care~r |   1.053366   .2058825     0.27   0.790      .718142    1.545071
------------------------------------------------------------------------------
                                                         Stratified by stpcode

.         forvalues k = `lo_`exp'' (1) `hi_`exp'' {
  2.                 capture qui di _b[`k'.`exp']
  3.                 if _rc==0 {
  4.                         post `ldrresults' (`i') ("`out'") ("`exp'")     //
> /
>                                 ("Confounders+Resid")                        
>                    ///
>                                 (`k') (1) (_b[`k'.`exp']) (_se[`k'.`exp'])
  5.                 }               
  6.                 forvalues l = 2 (1) 3 {
  7.                         capture qui di _b[`k'.`exp'#`l'.agebroad]
  8.                         if _rc==0 {
  9.                             lincom `k'.`exp' + `k'.`exp'#`l'.agebroad
 10.                                 post `ldrresults' (`i') ("`out'") ("`exp'"
> )             ///
>                                         ("Confounders+Resid")                
>                            ///
>                                         (`k') (`l') (r(estimate)) (r(se))
 11.                         }
 12.                 }
 13.         }

 ( 1)  0b.ds + 0b.ds#2o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.ds + 0b.ds#3o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#2.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2249979    .275692     0.82   0.414    -.3153485    .7653443
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#3.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2283436   .3258421    -0.70   0.483    -.8669823    .4102952
------------------------------------------------------------------------------

.         
.         * Confounders with physical comorbidities that are indicators for vac
> cination 
.         stcox i.`exp'##i.agebroad age1 age2 age3 male           ///
>                                 i.ethnicity_5                                
>                    ///
>                                 obese40                                      
>                            ///
>                                 respiratory asthma_severe                    
>            ///
>                                 cardiac af dvt_pe i.diabcat                  
>            ///
>                                 liver stroke tia dementia                    
>            ///
>                                 i.kidneyfn                                   
>                            ///
>                                 spleen transplant dialysis                   
>            ///
>                                 immunosuppression cancerHaem                 
>    ///
>                                 autoimmune ibd cancerExhaem1yr,              
>    ///
>                 strata(stpcode) cluster(household_id) 

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

Iteration 0:   log pseudolikelihood = -687.13142
Iteration 1:   log pseudolikelihood = -685.15816
Iteration 2:   log pseudolikelihood = -674.10613
Iteration 3:   log pseudolikelihood =  -672.6699
Iteration 4:   log pseudolikelihood =  -672.4758
Iteration 5:   log pseudolikelihood = -672.46727
Iteration 6:   log pseudolikelihood = -672.46724
Refining estimates:
Iteration 0:   log pseudolikelihood = -672.46724

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        6,087             Number of obs    =       6,087
No. of failures      =          131
Time at risk         =  2916.769336
                                                Wald chi2(36)    =       34.24
Log pseudolikelihood =   -672.46724             Prob > chi2      =      0.5525

                         (Std. Err. adjusted for 986 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        1.ds |    .781345   .2194511    -0.88   0.380     .4505797    1.354921
             |
    agebroad |
     65-<75  |   .9704721   .4945587    -0.06   0.953     .3574419    2.634879
        75+  |   3.883738   3.227492     1.63   0.103     .7618657    19.79801
             |
 ds#agebroad |
   1#65-<75  |   1.280275   1.088784     0.29   0.771      .241778    6.779381
      1#75+  |   .7741004   .6223357    -0.32   0.750     .1601313    3.742125
             |
        age1 |   1.001948   .0489361     0.04   0.968     .9104823    1.102602
        age2 |    1.01059   .1204409     0.09   0.930     .8000738    1.276498
        age3 |   .8901348   .2769127    -0.37   0.708     .4837877    1.637784
        male |   1.018345   .1774965     0.10   0.917     .7236547    1.433041
             |
 ethnicity_5 |
      Mixed  |   1.017852   .3151194     0.06   0.954     .5548291    1.867284
Asian or ..  |   1.533418   .4281267     1.53   0.126     .8871709    2.650416
      Black  |   1.347595   .3752002     1.07   0.284     .7808473    2.325695
      Other  |   1.701096   .4870918     1.86   0.064     .9705005    2.981686
             |
     obese40 |   1.224436    .246732     1.00   0.315     .8249227    1.817435
 respiratory |   1.326316   .2780423     1.35   0.178     .8794381     2.00027
asthma_sev~e |   .8369489   .2511936    -0.59   0.553      .464759    1.507197
     cardiac |   1.188783   .2385056     0.86   0.389       .80228    1.761486
          af |   .9298439    .216007    -0.31   0.754     .5897555    1.466048
      dvt_pe |   .8262307   .2080949    -0.76   0.449     .5043328    1.353585
             |
     diabcat |
Controlle..  |   1.258333   .2752299     1.05   0.293     .8196258    1.931858
Uncontrol..  |   .6366958   .3752166    -0.77   0.444     .2005872    2.020974
Diabetes,..  |    9.03097   9.696702     2.05   0.040     1.100995    74.07703
             |
       liver |   .8928863    .201625    -0.50   0.616     .5735669    1.389979
      stroke |   .9576053   .2145135    -0.19   0.847     .6173175    1.485472
         tia |   1.005019   .2326954     0.02   0.983     .6383995    1.582179
    dementia |   .8686769   .1968619    -0.62   0.534     .5571302     1.35444
             |
    kidneyfn |
Stage 3a/..  |   1.364794   1.390253     0.31   0.760     .1853477    10.04956
Stage 4/5..  |   1.297221    .367091     0.92   0.358     .7449699    2.258859
             |
      spleen |   .8994114   .1641934    -0.58   0.561     .6288775    1.286325
  transplant |   1.065149   .2503706     0.27   0.788     .6719382    1.688461
    dialysis |   .7931273   .2602023    -0.71   0.480     .4169539    1.508682
immunosupp~n |   .7475015   .1395283    -1.56   0.119     .5184742    1.077698
  cancerHaem |    .915297   .0719782    -1.13   0.260     .7845566    1.067824
  autoimmune |   1.059616   .2221023     0.28   0.782     .7026371     1.59796
         ibd |   .8118666   .2055356    -0.82   0.410     .4943002    1.333455
cancerExha~r |   1.395605   1.418953     0.33   0.743     .1902482    10.23775
------------------------------------------------------------------------------
                                                         Stratified by stpcode

.         forvalues k = `lo_`exp'' (1) `hi_`exp'' {
  2.                 capture qui di _b[`k'.`exp']
  3.                 if _rc==0 {
  4.                         post `ldrresults' (`i') ("`out'") ("`exp'") ///
>                         ("Confounders+Comorb")                               
>            ///
>                         (`k') (1) (_b[`k'.`exp']) (_se[`k'.`exp'])
  5.                 }
  6.                                 forvalues l = 2 (1) 3 {
  7.                         capture qui di _b[`k'.`exp'#`l'.agebroad]
  8.                         if _rc==0 {
  9.                             lincom `k'.`exp' + `k'.`exp'#`l'.agebroad
 10.                                 post `ldrresults' (`i') ("`out'") ("`exp'"
> )             ///
>                                         ("Confounders+Comorb")               
>                            ///
>                                         (`k') (`l') (r(estimate)) (r(se))
 11.                         }
 12.                 }
 13.         }

 ( 1)  0b.ds + 0b.ds#2o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.ds + 0b.ds#3o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#2.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0003367   .8041966     0.00   1.000     -1.57586    1.576533
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#3.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.5027922   .7465236    -0.67   0.501    -1.965952    .9603671
------------------------------------------------------------------------------

.         
.         * All variables
.         stcox i.`exp'##i.agebroad age1 age2 age3 male           ///
>                                 i.ethnicity_5 imd resid_care_ldr             
>    ///
>                                 obese40                                      
>                            ///
>                                 respiratory asthma_severe                    
>            ///
>                                 cardiac af dvt_pe i.diabcat                  
>            ///
>                                 liver stroke tia dementia                    
>            ///
>                                 i.kidneyfn                                   
>                            ///
>                                 spleen transplant dialysis                   
>            ///
>                                 immunosuppression cancerHaem                 
>    ///
>                                 autoimmune ibd cancerExhaem1yr,              
>    ///
>                                 strata(stpcode) cluster(household_id) 

         failure _d:  coviddeath1
   analysis time _t:  stime_coviddeath1/365.25

Iteration 0:   log pseudolikelihood = -687.13142
Iteration 1:   log pseudolikelihood = -684.63969
Iteration 2:   log pseudolikelihood = -673.61226
Iteration 3:   log pseudolikelihood = -672.18168
Iteration 4:   log pseudolikelihood = -671.98847
Iteration 5:   log pseudolikelihood = -671.98001
Iteration 6:   log pseudolikelihood = -671.97998
Refining estimates:
Iteration 0:   log pseudolikelihood = -671.97998

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        6,087             Number of obs    =       6,087
No. of failures      =          131
Time at risk         =  2916.769336
                                                Wald chi2(38)    =       36.12
Log pseudolikelihood =   -671.97998             Prob > chi2      =      0.5565

                         (Std. Err. adjusted for 986 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        1.ds |   .7796056   .2196102    -0.88   0.377     .4488452    1.354108
             |
    agebroad |
     65-<75  |   .9795572   .4992442    -0.04   0.968     .3607478    2.659842
        75+  |   3.938334   3.272681     1.65   0.099      .772645    20.07451
             |
 ds#agebroad |
   1#65-<75  |   1.290366   1.098312     0.30   0.765     .2433332    6.842648
      1#75+  |   .7868236   .6296671    -0.30   0.764     .1639423    3.776277
             |
        age1 |   1.002651   .0491512     0.05   0.957     .9107999    1.103765
        age2 |   1.008605   .1206361     0.07   0.943     .7978321     1.27506
        age3 |   .8937864   .2787552    -0.36   0.719     .4850204    1.647053
        male |   1.019626   .1781133     0.11   0.911     .7240175     1.43593
             |
 ethnicity_5 |
      Mixed  |   1.020006   .3157899     0.06   0.949     .5559986    1.871248
Asian or ..  |   1.533474   .4274666     1.53   0.125     .8879694    2.648224
      Black  |   1.351058   .3761971     1.08   0.280     .7828163    2.331782
      Other  |   1.708085   .4879463     1.87   0.061     .9757706    2.989999
             |
         imd |   .9935522   .0641068    -0.10   0.920     .8755254     1.12749
resid_care~r |    .664978    .259544    -1.05   0.296     .3094421     1.42901
     obese40 |   1.232181   .2476561     1.04   0.299     .8309818     1.82708
 respiratory |   1.328519   .2782272     1.36   0.175     .8812592    2.002774
asthma_sev~e |   .8397919   .2520947    -0.58   0.561     .4662855    1.512486
     cardiac |   1.187944   .2381569     0.86   0.390     .8019525    1.759719
          af |   .9319178   .2169375    -0.30   0.762     .5905133    1.470705
      dvt_pe |   .8225903   .2074199    -0.77   0.439     .5018214    1.348397
             |
     diabcat |
Controlle..  |    1.26086   .2758905     1.06   0.289     .8211348    1.936063
Uncontrol..  |    .637264   .3760349    -0.76   0.445     .2004679    2.025788
Diabetes,..  |   9.152776   9.839049     2.06   0.039     1.113085    75.26226
             |
       liver |   .8868292   .1992323    -0.53   0.593     .5709679    1.377426
      stroke |   .9602231   .2149742    -0.18   0.856     .6191639    1.489151
         tia |   1.000853   .2306535     0.00   0.997     .6370965    1.572301
    dementia |   .8628375   .1951913    -0.65   0.514     .5538217    1.344275
             |
    kidneyfn |
Stage 3a/..  |   1.359183   1.383298     0.30   0.763     .1849158    9.990373
Stage 4/5..  |   1.300514   .3679919     0.93   0.353     .7468957    2.264488
             |
      spleen |    .895598   .1633671    -0.60   0.546     .6263895    1.280506
  transplant |   1.056437   .2487493     0.23   0.816     .6659157    1.675977
    dialysis |   .7965582   .2622444    -0.69   0.490     .4178143    1.518629
immunosupp~n |   .7456736   .1395544    -1.57   0.117     .5167073    1.076101
  cancerHaem |   .9162704   .0722774    -1.11   0.268      .785017    1.069469
  autoimmune |   1.056298   .2207681     0.26   0.793     .7012678    1.591069
         ibd |    .815429   .2064599    -0.81   0.420     .4964425    1.339378
cancerExha~r |   1.420439   1.446866     0.34   0.730     .1929235    10.45828
------------------------------------------------------------------------------
                                                         Stratified by stpcode

.         forvalues k = `lo_`exp'' (1) `hi_`exp'' {
  2.                 capture qui di _b[`k'.`exp']
  3.                 if _rc==0 {
  4.                         post `ldrresults' (`i') ("`out'") ("`exp'")     //
> /
>                         ("All")                                              
>                                    ///
>                         (`k') (1) (_b[`k'.`exp']) (_se[`k'.`exp'])
  5.                 }
  6.                                 forvalues l = 2 (1) 3 {
  7.                         capture qui di _b[`k'.`exp'#`l'.agebroad]
  8.                         if _rc==0 {
  9.                             lincom `k'.`exp' + `k'.`exp'#`l'.agebroad
 10.                                 post `ldrresults' (`i') ("`out'") ("`exp'"
> )     ///
>                                         ("All")                              
>                                    ///
>                                         (`k') (`l') (r(estimate)) (r(se))
 11.                         }
 12.                 }
 13.         }

 ( 1)  0b.ds + 0b.ds#2o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.ds + 0b.ds#3o.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#2.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0059584    .804581     0.01   0.994    -1.570991    1.582908
------------------------------------------------------------------------------

 ( 1)  1.ds + 1.ds#3.agebroad = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.4887183   .7439714    -0.66   0.511    -1.946875    .9694389
------------------------------------------------------------------------------

. 
. postclose `ldrresults'

. 
. use `ldrfile', clear

. 
. 
. *************************
. *  Tidy output for HRs  *
. *************************
. 
. * Outcome
. rename outcome out

. gen outcome     = 1 if out=="coviddeath"

. replace outcome = 2 if out=="covidadmission"
(0 real changes made)

. replace outcome = 3 if out=="composite"
(0 real changes made)

. 
. label define outcome    1 "COVID-19 death"              ///
>                                                 2 "COVID-19 admission"  ///
>                                                 3 "Composite"

. label values outcome outcome

. drop out

. 
. * Exposure
. rename exposure exp

. gen     exposure = 1 if exp=="ldr"
(30 missing values generated)

. replace exposure = 2 if exp=="ldr_cat"
(0 real changes made)

. replace exposure = 3 if exp=="ldr_carecat"
(0 real changes made)

. replace exposure = 4 if exp=="ds"
(30 real changes made)

. replace exposure = 5 if exp=="cp"
(0 real changes made)

. replace exposure = 6 if exp=="ldr_group"
(0 real changes made)

. 
. label define exposure   1 "Learning disability register"        ///
>                                                 2 "LDR Severe vs mild"       
>                    ///
>                                                 3 "LDR by residential care"  
>                    ///
>                                                 4 "Down's syndrome"          
>                            ///
>                                                 5 "Cerebral Palsy"           
>                            ///
>                                                 6 "Combined grouping"        
>                    

. label values exposure exposure                                          

. drop exp

. 
. * Age categories
. label define agebroad   1 "16-<65"              ///
>                                                 2 "65-<75"              ///
>                                                 3 "75+"

. label values agebroad agebroad

. 
. 
. * Categories of exposure
. gen category     = "No"                                         if expcat==0
(15 missing values generated)

. replace category = "Yes"                                        if inlist(exp
> osure, 1, 4, 5) & expcat==1
variable category was str2 now str3
(15 real changes made)

. 
. replace category = "LDR, mild"                          if inlist(exposure, 2
> ) & expcat==1
(0 real changes made)

. replace category = "LDR, profound"                      if inlist(exposure, 2
> ) & expcat==2
(0 real changes made)

. 
. replace category = "LDR, community"             if inlist(exposure, 3) & expc
> at==1
(0 real changes made)

. replace category = "LDR, residential care"      if inlist(exposure, 3) & expc
> at==2
(0 real changes made)

. 
. replace category = "DS but not LDR"             if inlist(exposure, 6) & expc
> at==1
(0 real changes made)

. replace category = "DS and LDR"                         if inlist(exposure, 6
> ) & expcat==2
(0 real changes made)

. replace category = "CP but not LDR"             if inlist(exposure, 6) & expc
> at==3
(0 real changes made)

. replace category = "CP and LDR"                         if inlist(exposure, 6
> ) & expcat==4
(0 real changes made)

. replace category = "LDR with no DS or CP"       if inlist(exposure, 6) & expc
> at==5
(0 real changes made)

. 
. * Model adjustment
. gen     adjustment = 1 if model=="Confounders"
(24 missing values generated)

. replace adjustment = 2 if model=="Confounders+IMD"
(6 real changes made)

. replace adjustment = 3 if model=="Confounders+Resid"
(6 real changes made)

. replace adjustment = 4 if model=="Confounders+Comorb"
(6 real changes made)

. replace adjustment = 5 if model=="All"
(6 real changes made)

. label define adj        1 "Confounders"                                      
>    ///     
>                                         2 "Confounders with IMD"             
>            ///
>                                         3 "Confounders with care"            
>            ///
>                                         4 "Confounders with comorbidities"   
>    ///
>                                         5 "All"

. label values adjustment adj

. drop model

. 
. * Hazard ratio with 95% confidence interval
. gen cl = exp(lnhr - invnorm(0.975)*sehr)

. gen cu = exp(lnhr + invnorm(0.975)*sehr)

. gen hr = exp(lnhr)

. 
. gen hr_ci =   string(round(hr, 0.01)) + " (" ///
>                         + string(round(cl, 0.01)) + ", " ///
>                         + string(round(cu, 0.01)) + ")"

. replace hr_ci = "" if expcat==0
(15 real changes made)

. drop cl cu hr lnhr sehr

. 
. * Put in wide format
. reshape wide hr_ci, i(wave outcome exposure expcat agebroad) j(adjust)
(note: j = 1 2 3 4 5)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       30   ->       6
Number of variables                   8   ->      11
j variable (5 values)        adjustment   ->   (dropped)
xij variables:
                                  hr_ci   ->   hr_ci1 hr_ci2 ... hr_ci5
-----------------------------------------------------------------------------

. rename hr_ci1 hr_conf

. rename hr_ci2 hr_conf_imd

. rename hr_ci3 hr_conf_resid

. rename hr_ci4 hr_conf_comorb

. 
. 
. order wave outcome exposure agebroad category hr*

. sort wave outcome exposure agebroad expcat

. 
. * Save data
. outsheet using "output/ldcox_inter_wave`i'_`out'_`exp'", replace
(note: file output/ldcox_inter_wave1_coviddeath_ds.out not found)

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/AL006_cox_regression_inter_wave1_coviddeath_ds.log
  log type:  text
 closed on:  25 Feb 2021, 20:20:37
-------------------------------------------------------------------------------
