-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/AL004_1_cox_regression.log
  log type:  text
 opened on:  17 Feb 2021, 13:26:39

. 
. 
. * Categories of various exposures
. local lo_ldr            = 0

. local hi_ldr            = 1

. local lo_ldr_cat        = 0

. local hi_ldr_cat        = 2

. local hi_ldr            = 1

. local lo_ldr_carecat= 0

. local hi_ldr_carecat= 2

. local lo_ds             = 0

. local hi_ds             = 1

. local lo_cp             = 0

. local hi_cp             = 1

. local lo_ldr_group      = 0

. local hi_ldr_group      = 5

. 
. * Open temporary file to post results
. tempfile ldrfile

. tempname ldrresults

. 
. postfile `ldrresults'   wave str15(outcome) str15(exposure) str20(model)     
>    ///
>                                                 expcat lnhr sehr using `ldrfi
> le'

. 
. 
. * Open dataset (complete case ethnicity)
. use "analysis/data_ldanalysis_cohort`i'.dta", clear 
(Analysis dataset, wave 2 (1 Sept 20 - latest), for learning disability work)

. drop if ethnicity_5>=.
(11,202 observations deleted)

. 
. * Only keep data for adults
. keep if child==0
(6,485 observations deleted)

. 
. /*  Declare data to be survival  */
. 
. stset stime_`out'`i', fail(`out'`i') scale(365.25)

     failure event:  coviddeath2 != 0 & coviddeath2 < .
obs. time interval:  (0, stime_coviddeath2]
 exit on or before:  failure
    t for analysis:  time/365.25

------------------------------------------------------------------------------
     27,050  total observations
          0  exclusions
------------------------------------------------------------------------------
     27,050  observations remaining, representing
        506  failures in single-record/single-failure data
 11,466.984  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .4462697

. 
. 
. /*  Obtain rates  */
.                         
. strate `exp',                                                                
>                            ///
>         output(analysis/data_temp_`i'_`out'_`exp', replace)     ///
>         per(10000)

         failure _d:  coviddeath2
   analysis time _t:  stime_coviddeath2/365.25

Estimated rates (per 10000) and lower/upper bounds of 95% confidence intervals
(27050 records included in the analysis)

  +----------------------------------------------------------------+
  |            ldr_group     D        Y     Rate    Lower    Upper |
  |----------------------------------------------------------------|
  | No DS, no CP, no LDR   210   0.4512   465.40   406.52   532.80 |
  |       DS but not LDR    42   0.1089   385.80   285.12   522.04 |
  |           DS and LDR    34   0.0710   478.64   342.00   669.86 |
  |       CP but not LDR    62   0.1407   440.52   343.45   565.03 |
  |           CP and LDR    35   0.0854   409.96   294.35   570.98 |
  |----------------------------------------------------------------|
  |  LD with no DS or CP   123   0.2895   424.93   356.10   507.07 |
  +----------------------------------------------------------------+


.                 
.                 
. /*  Fit Cox models  */
.                         
. * Confounder only model
. stcox i.`exp' age1 age2 age3 male i.ethnicity_5,        ///
>         strata(stpcode) cluster(household_id) 

         failure _d:  coviddeath2
   analysis time _t:  stime_coviddeath2/365.25

Iteration 0:   log pseudolikelihood = -3401.3908
Iteration 1:   log pseudolikelihood = -3398.5541
Iteration 2:   log pseudolikelihood = -3398.5495
Refining estimates:
Iteration 0:   log pseudolikelihood = -3398.5495

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       27,050             Number of obs    =      27,050
No. of failures      =          506
Time at risk         =  11466.98426
                                                Wald chi2(13)    =        5.99
Log pseudolikelihood =   -3398.5495             Prob > chi2      =      0.9466

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   ldr_group |
DS but no..  |    .837999   .1465859    -1.01   0.312     .5947687    1.180698
 DS and LDR  |   1.024373   .1846437     0.13   0.894     .7194964    1.458437
CP but no..  |   .9503817   .1369233    -0.35   0.724     .7165787    1.260469
 CP and LDR  |    .885827   .1604244    -0.67   0.503     .6211481    1.263289
LD with n..  |   .9135599    .104128    -0.79   0.428     .7306623     1.14224
             |
        age1 |   .9867041   .0280335    -0.47   0.638     .9332612    1.043207
        age2 |   1.033889   .0705532     0.49   0.625     .9044558    1.181845
        age3 |   .9231539   .1542514    -0.48   0.632     .6653427    1.280863
        male |   .9482232   .0865585    -0.58   0.560     .7928822    1.133998
             |
 ethnicity_5 |
      Mixed  |    1.19778   .1648732     1.31   0.190     .9145555    1.568715
Asian or ..  |   1.057144   .1495759     0.39   0.695     .8011193     1.39499
      Black  |   1.023601   .1446404     0.17   0.869     .7759814    1.350237
      Other  |   .9497648   .1363791    -0.36   0.720     .7167867    1.258468
------------------------------------------------------------------------------
                                                         Stratified by stpcode

. forvalues k = `lo_`exp'' (1) `hi_`exp'' {
  2.         capture qui di _b[`k'.`exp']
  3.         if _rc==0 {
  4.                 post `ldrresults' (`i') ("`out'") ("`exp'")             //
> /
>                         ("Confounders")                                      
>                    ///
>                         (`k') (_b[`k'.`exp']) (_se[`k'.`exp'])
  5.         }
  6. }

. 
. 
. postclose `ldrresults'

. 
. use `ldrfile', clear

. 
. *************************
. *  Tidy output for HRs  *
. *************************
. 
. * Outcome
. rename outcome out

. gen outcome     = 1 if out=="coviddeath"

. replace outcome = 2 if out=="covidadmission"
(0 real changes made)

. replace outcome = 3 if out=="composite"
(0 real changes made)

. 
. label define outcome    1 "COVID-19 death"              ///
>                                                 2 "COVID-19 admission"  ///
>                                                 3 "Composite"

. label values outcome outcome

. drop out

. 
. * Exposure
. rename exposure exp

. gen     exposure = 1 if exp=="ldr"
(6 missing values generated)

. replace exposure = 2 if exp=="ldr_cat"
(0 real changes made)

. replace exposure = 3 if exp=="ldr_carecat"
(0 real changes made)

. replace exposure = 4 if exp=="ds"
(0 real changes made)

. replace exposure = 5 if exp=="cp"
(0 real changes made)

. replace exposure = 6 if exp=="ldr_group"
(6 real changes made)

. 
. label define exposure   1 "Learning disability register"        ///
>                                                 2 "LDR Severe vs mild"       
>                    ///
>                                                 3 "LDR by residential care"  
>                    ///
>                                                 4 "Down's syndrome"          
>                            ///
>                                                 5 "Cerebral Palsy"           
>                            ///
>                                                 6 "Combined grouping"        
>                    

. label values exposure exposure                                          

. drop exp

. 
. * Categories of exposure
. gen category     = "No"                                         if expcat==0
(5 missing values generated)

. replace category = "Yes"                                        if inlist(exp
> osure, 1, 4, 5) & expcat==1
(0 real changes made)

. 
. replace category = "LDR, mild"                          if inlist(exposure, 2
> ) & expcat==1
(0 real changes made)

. replace category = "LDR, profound"                      if inlist(exposure, 2
> ) & expcat==2
(0 real changes made)

. 
. replace category = "LDR, community"             if inlist(exposure, 3) & expc
> at==1
(0 real changes made)

. replace category = "LDR, residential care"      if inlist(exposure, 3) & expc
> at==2
(0 real changes made)

. 
. replace category = "DS but not LDR"             if inlist(exposure, 6) & expc
> at==1
variable category was str2 now str14
(1 real change made)

. replace category = "DS and LDR"                         if inlist(exposure, 6
> ) & expcat==2
(1 real change made)

. replace category = "CP but not LDR"             if inlist(exposure, 6) & expc
> at==3
(1 real change made)

. replace category = "CP and LDR"                         if inlist(exposure, 6
> ) & expcat==4
(1 real change made)

. replace category = "LDR with no DS or CP"       if inlist(exposure, 6) & expc
> at==5
variable category was str14 now str20
(1 real change made)

. 
. * Model adjustment
. gen     adjustment = 1 if model=="Confounders"

. replace adjustment = 2 if model=="Confounders+IMD"
(0 real changes made)

. replace adjustment = 3 if model=="Confounders+Resid"
(0 real changes made)

. replace adjustment = 4 if model=="Confounders_Comorb"
(0 real changes made)

. label define adj        1 "Confounders"                         ///     
>                                         2 "Confounders with IMD"        ///
>                                         3 "Confounders with care"       ///
>                                         4 "Confounders with comorbidities"   
>    

. label values adjustment adj

. drop model

. 
. * Hazard ratio with 95% confidence interval
. gen cl = exp(lnhr - invnorm(0.975)*sehr)

. gen cu = exp(lnhr + invnorm(0.975)*sehr)

. gen hr = exp(lnhr)

. 
. gen hr_ci =   string(round(hr, 0.01)) + " (" ///
>                         + string(round(cl, 0.01)) + ", " ///
>                         + string(round(cu, 0.01)) + ")"

. replace hr_ci = "" if expcat==0
(1 real change made)

. drop cl cu hr lnhr sehr

. 
. * Put in wide format
. reshape wide hr_ci, i(wave outcome exposure expcat) j(adjust)
(note: j = 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        6   ->       6
Number of variables                   7   ->       6
j variable (1 values)        adjustment   ->   (dropped)
xij variables:
                                  hr_ci   ->   hr_ci1
-----------------------------------------------------------------------------

. rename hr_ci1 hr_conf

. 
. order wave outcome exposure category hr*

. sort wave outcome exposure expcat

. 
. * Save data
. outsheet using "output/output_hrs_main_`i'_`out'_`exp'", replace
(note: file output/output_hrs_main_2_coviddeath_ldr_group.out not found)

. 
. 
. 
. ***************************
. *  Tidy output for rates  *
. ***************************
. 
. use "analysis/data_temp_`i'_`out'_`exp'", clear
(Analysis dataset, wave 2 (1 Sept 20 - latest), for learning disability work)

. gen out  = "`out'"

. gen exp  = "`exp'" 

. gen wave = `i'

. 
. * Outcome
. gen outcome     = 1 if out=="coviddeath"

. replace outcome = 2 if out=="covidadmission"
(0 real changes made)

. replace outcome = 3 if out=="composite"
(0 real changes made)

. 
. label define outcome    1 "COVID-19 death"              ///
>                                                 2 "COVID-19 admission"  ///
>                                                 3 "Composite"

. label values outcome outcome

. drop out

. 
. * Exposure
. gen     exposure = 1 if exp=="ldr"
(6 missing values generated)

. replace exposure = 2 if exp=="ldr_cat"
(0 real changes made)

. replace exposure = 3 if exp=="ldr_carecat"
(0 real changes made)

. replace exposure = 4 if exp=="ds"
(0 real changes made)

. replace exposure = 5 if exp=="cp"
(0 real changes made)

. replace exposure = 6 if exp=="ldr_group"
(6 real changes made)

. 
. label define exposure   1 "Learning disability register"        ///
>                                                 2 "LDR Severe vs mild"       
>                    ///
>                                                 3 "LDR by residential care"  
>                    ///
>                                                 4 "Down's syndrome"          
>                            ///
>                                                 5 "Cerebral Palsy"           
>                            ///
>                                                 6 "Combined grouping"        
>                    

. label values exposure exposure                                          

. drop exp

. 
. * Categories of exposure
. rename ldr_group expcat

. gen category     = "No"                                         if expcat==0
(5 missing values generated)

. replace category = "Yes"                                        if inlist(exp
> osure, 1, 4, 5) & expcat==1
(0 real changes made)

. 
. replace category = "LDR, mild"                          if inlist(exposure, 2
> ) & expcat==1
(0 real changes made)

. replace category = "LDR, profound"                      if inlist(exposure, 2
> ) & expcat==2
(0 real changes made)

. 
. replace category = "LDR, community"             if inlist(exposure, 3) & expc
> at==1
(0 real changes made)

. replace category = "LDR, residential care"      if inlist(exposure, 3) & expc
> at==2
(0 real changes made)

. 
. replace category = "DS but not LDR"             if inlist(exposure, 6) & expc
> at==1
variable category was str2 now str14
(1 real change made)

. replace category = "DS and LDR"                         if inlist(exposure, 6
> ) & expcat==2
(1 real change made)

. replace category = "CP but not LDR"             if inlist(exposure, 6) & expc
> at==3
(1 real change made)

. replace category = "CP and LDR"                         if inlist(exposure, 6
> ) & expcat==4
(1 real change made)

. replace category = "LDR with no DS or CP"       if inlist(exposure, 6) & expc
> at==5
variable category was str14 now str20
(1 real change made)

. 
. * Rename remaining variables
. rename _D events

. rename _Y pyr_10000

. rename _Rate rate_per_10000

. rename _Lower rate_cl

. rename _Upper rate_cu

. 
. order wave outcome exposure category events pyr rate*

. sort wave outcome exposure expcat

. 
. 
. * Save data
. outsheet using "output/output_rates_`i'_`out'_`exp'", replace
(note: file output/output_rates_2_coviddeath_ldr_group.out not found)

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/AL004_1_cox_regression.log
  log type:  text
 closed on:  17 Feb 2021, 13:26:42
-------------------------------------------------------------------------------
