-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/AL002_tabulate_cohort_descriptives.log
  log type:  text
 opened on:  17 Feb 2021, 13:22:25

. 
. * Add ado files
. adopath++ `c(pwd)'\analysis
  [1]              "/workspace\analysis"
  [2]  (BASE)      "/usr/local/stata/ado/base/"
  [3]  (SITE)      "/usr/local/ado/"
  [4]              "."
  [5]  (PERSONAL)  "~/ado/personal/"
  [6]  (PLUS)      "~/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. 
. *************************************************
. *   Program: generaterow                                                *
. *                                                                            
>                    *
. *       Generic code to output one row of table         *
. *************************************************
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) binexp(varname) condition(string) file(string)
  2.         
.         * Counts among exposed
.         safecount if `binexp'==1
  3.         local expdenom = r(N)
  4.         safecount if `variable' `condition' & `binexp'==1
  5.         file write `file' ("`variable'") _tab ("`condition'") _tab (r(N)) 
> (" (") %2.0f (100*(r(N))/`expdenom') (")") _tab
  6. 
.         * Counts among unexposed
.         safecount if `binexp'==0
  7.         local unexpdenom = r(N)
  8.         safecount if `variable' `condition' & `binexp'==0
  9.         file write `file' (r(N)) (" (") %2.0f (100*(r(N))/`unexpdenom') ("
> )") _n
 10. 
. end

. 
. 
. 
. 
. *************************************************
. *   Program: tabulatevariable                                   *
. *                                                                            
>                    *
. *       Generic code to output one section                      *
. *   (variable) within table                                             *
. *************************************************
. 
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1.         syntax, variable(varname) binexp(varname) ///
>                 start(real) end(real) [missing] file(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') binexp(`binexp') ///
>                         condition("==`varlevel'") file(`file')
  4.         }
  5.         if "`missing'"!="" generaterow, ///
>                 variable(`variable') binexp(`binexp')  ///
>                         condition(">=.") file(`file')
  6. 
. end

. 
. 
. 
. 
. 
. *************************
. *  Create table output  *
. *************************
. 
. 
. 
. cap file close tablecontent

. file open tablecontent using "output/basetable1.txt", write text replace
(note: file output/basetable1.txt not found)

. 
. 
. 
. /*  Open cohort and extract covariates  */
.         
. use "analysis/data_ldanalysis_cohort1.dta", clear 
(Analysis dataset, wave 1 (1 Mar - 31 Aug 20), for learning disability work)

. 
. * Complete case for ethnicity  
. drop if ethnicity_5>=.
(12,499 observations deleted)

. 
. 
. 
. /* Table: Demographic variables  */
. 
. gen byte cons=1

. tabulatevariable, variable(cons) start(1) end(1) file(tablecontent) binexp(ld
> r)
  14,739
  14,739
  22,754
  22,754

. file write tablecontent _n 

. 
. tabulatevariable, variable(agegroup) start(1) end(7) file(tablecontent) binex
> p(ldr)
  14,739
  2,797
  22,754
  4,383
  14,739
  5,493
  22,754
  8,446
  14,739
  3,770
  22,754
  5,841
  14,739
  747
  22,754
  1,159
  14,739
  728
  22,754
  1,105
  14,739
  502
  22,754
  759
  14,739
  702
  22,754
  1,061

. file write tablecontent _n 

. 
. tabulatevariable, variable(male) start(0) end(1) file(tablecontent) binexp(ld
> r)
  14,739
  7,462
  22,754
  11,416
  14,739
  7,277
  22,754
  11,338

. file write tablecontent _n 

. 
. tabulatevariable, variable(ethnicity_5) start(1) end(5) file(tablecontent) bi
> nexp(ldr)
  14,739
  2,958
  22,754
  4,529
  14,739
  2,971
  22,754
  4,517
  14,739
  2,957
  22,754
  4,558
  14,739
  2,964
  22,754
  4,506
  14,739
  2,889
  22,754
  4,644

. file write tablecontent _n 

. 
. tabulatevariable, variable(region_7) start(1) end(7) file(tablecontent) binex
> p(ldr)
  14,739
  1,460
  22,754
  2,269
  14,739
  3,016
  22,754
  4,587
  14,739
  4,414
  22,754
  6,856
  14,739
  2,947
  22,754
  4,519
  14,739
  1,404
  22,754
  2,260
  14,739
  1,498
  22,754
  2,263
  14,739
  0
  22,754
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(imd) start(1) end(5) file(tablecontent) binexp(ldr
> )
  14,739
  3,054
  22,754
  4,545
  14,739
  2,970
  22,754
  4,621
  14,739
  2,846
  22,754
  4,578
  14,739
  3,005
  22,754
  4,464
  14,739
  2,864
  22,754
  4,546

. file write tablecontent _n 

. 
. 
. 
. /* Table: Learning disability  */
. 
. tabulatevariable, variable(ld_profound) start(0) end(1) file(tablecontent) bi
> nexp(ldr)
  14,739
  11,828
  22,754
  18,310
  14,739
  2,911
  22,754
  4,444

. file write tablecontent _n 

. 
. tabulatevariable, variable(resid_care_ldr) start(0) end(1) file(tablecontent)
>  binexp(ldr)
  14,739
  461
  22,754
  952
  14,739
  14,278
  22,754
  21,802

. file write tablecontent _n 

. 
. tabulatevariable, variable(ds) start(0) end(1) file(tablecontent) binexp(ldr)
  14,739
  11,850
  22,754
  18,315
  14,739
  2,889
  22,754
  4,439

. file write tablecontent _n 

. 
. tabulatevariable, variable(cp) start(0) end(1) file(tablecontent) binexp(ldr)
  14,739
  11,869
  22,754
  18,261
  14,739
  2,870
  22,754
  4,493

. file write tablecontent _n 

. 
. 
. 
. /* Table: Comorbidities  */
. 
. tabulatevariable, variable(asthma_severe) start(1) end(1) file(tablecontent) 
> binexp(ldr)
  14,739
  289
  22,754
  436

. file write tablecontent _n 

. tabulatevariable, variable(cf) start(1) end(1) file(tablecontent) binexp(ldr)
  14,739
  2,915
  22,754
  4,487

. file write tablecontent _n 

. tabulatevariable, variable(respiratory) start(1) end(1) file(tablecontent) bi
> nexp(ldr)
  14,739
  2,873
  22,754
  4,431

. file write tablecontent _n 

. tabulatevariable, variable(cardiac) start(1) end(1) file(tablecontent) binexp
> (ldr)
  14,739
  2,813
  22,754
  4,466

. file write tablecontent _n 

. tabulatevariable, variable(af) start(1) end(1) file(tablecontent) binexp(ldr)
  14,739
  2,806
  22,754
  4,515

. file write tablecontent _n 

. tabulatevariable, variable(dvt_pe) start(1) end(1) file(tablecontent) binexp(
> ldr)
  14,739
  2,876
  22,754
  4,476

. file write tablecontent _n 

. tabulatevariable, variable(diabcat) start(2) end(4) file(tablecontent) binexp
> (ldr)
  14,739
  2,272
  22,754
  3,647
  14,739
  538
  22,754
  818
  14,739
  11
  22,754
  17

. file write tablecontent _n 

. tabulatevariable, variable(liver) start(1) end(1) file(tablecontent) binexp(l
> dr)
  14,739
  2,850
  22,754
  4,445

. file write tablecontent _n 

. tabulatevariable, variable(stroke) start(1) end(1) file(tablecontent) binexp(
> ldr)
  14,739
  2,869
  22,754
  4,435

. file write tablecontent _n 

. tabulatevariable, variable(tia) start(1) end(1) file(tablecontent) binexp(ldr
> )
  14,739
  2,905
  22,754
  4,468

. file write tablecontent _n 

. tabulatevariable, variable(dementia) start(1) end(1) file(tablecontent) binex
> p(ldr)
  14,739
  2,915
  22,754
  4,442

. file write tablecontent _n 

. tabulatevariable, variable(kidneyfn) start(2) end(3) file(tablecontent) binex
> p(ldr)
  14,739
  90
  22,754
  115
  14,739
  5,195
  22,754
  8,053

. file write tablecontent _n 

. tabulatevariable, variable(spleen) start(1) end(1) file(tablecontent) binexp(
> ldr)
  14,739
  5,319
  22,754
  8,058

. file write tablecontent _n 

. tabulatevariable, variable(transplant) start(1) end(1) file(tablecontent) bin
> exp(ldr)
  14,739
  5,099
  22,754
  8,090

. file write tablecontent _n 

. tabulatevariable, variable(immunosuppression) start(1) end(1) file(tableconte
> nt) binexp(ldr)
  14,739
  5,296
  22,754
  8,128

. file write tablecontent _n 

. tabulatevariable, variable(cancerHaem) start(2) end(3) file(tablecontent) bin
> exp(ldr)
  14,739
  66
  22,754
  82
  14,739
  248
  22,754
  325

. file write tablecontent _n 

. tabulatevariable, variable(cancerExhaem1yr) start(1) end(1) file(tablecontent
> ) binexp(ldr)
  14,739
  82
  22,754
  140

. file write tablecontent _n 

. tabulatevariable, variable(autoimmune) start(1) end(1) file(tablecontent) bin
> exp(ldr)
  14,739
  2,914
  22,754
  4,415

. file write tablecontent _n 

. tabulatevariable, variable(ibd) start(1) end(1) file(tablecontent) binexp(ldr
> )
  14,739
  2,903
  22,754
  4,484

. file write tablecontent _n 

. 
. tabulatevariable, variable(smi) start(1) end(1) file(tablecontent) binexp(ldr
> )
  14,739
  2,922
  22,754
  4,480

. file write tablecontent _n 

. tabulatevariable, variable(neuro) start(1) end(1) file(tablecontent) binexp(l
> dr)
  14,739
  2,992
  22,754
  4,433

. file write tablecontent _n 

. 
.         
. file close tablecontent

. 
. 
. * Close log
. log close
      name:  <unnamed>
       log:  /workspace/logs/AL002_tabulate_cohort_descriptives.log
  log type:  text
 closed on:  17 Feb 2021, 13:22:28
-------------------------------------------------------------------------------
