---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\emsuewil\Documents\Work\Covid\OpenSAFELY\Absolute_risks\absolute-risks-covid-research\logs/AR001b_tabulate_cohort
> _descriptives.log
  log type:  text
 opened on:  18 Feb 2021, 14:07:22

. 
. * Add ado files
. adopath++ `c(pwd)'\analysis
  [1]              "C:\Users\emsuewil\Documents\Work\Covid\OpenSAFELY\Absolute_risks\absolute-risks-covid-research\analysis"
  [2]              "C:\Users\emsuewil\Documents\Work\Covid\OpenSAFELY\Absolute_risks\absolute-risks-covid-research/analysis/ado"
  [3]  (BASE)      "C:\Program Files\Stata16\ado\base/"
  [4]  (SITE)      "C:\Program Files\Stata16\ado\site/"
  [5]              "."
  [6]  (PERSONAL)  "C:\Users\emsuewil\ado\personal/"
  [7]  (PLUS)      "C:\Users\emsuewil\ado\plus/"
  [8]  (OLDPLACE)  "c:\ado/"

. 
. 
. *************************************************
. *   Program: generaterow                                                *
. *                                                                                               *
. *       Generic code to output one row of table         *
. *************************************************
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) binexp(varname) condition(string) file(string)
  2.         
.         * Counts among exposed
.         safecount if `binexp'==1
  3.         local expdenom = r(N)
  4.         safecount if `variable' `condition' & `binexp'==1
  5.         file write `file' ("`variable'") _tab ("`condition'") _tab (r(N)) (" (") %2.0f (100*(r(N))/`expdenom') (")") _tab
  6. 
.         * Counts among unexposed
.         safecount if `binexp'==0
  7.         local unexpdenom = r(N)
  8.         safecount if `variable' `condition' & `binexp'==0
  9.         file write `file' (r(N)) (" (") %2.0f (100*(r(N))/`unexpdenom') (")") _n
 10. 
. end

. 
. 
. 
. 
. *************************************************
. *   Program: tabulatevariable                                   *
. *                                                                                               *
. *       Generic code to output one section                      *
. *   (variable) within table                                             *
. *************************************************
. 
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1.         syntax, variable(varname) binexp(varname) ///
>                 start(real) end(real) [missing] file(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') binexp(`binexp') ///
>                         condition("==`varlevel'") file(`file')
  4.         }
  5.         if "`missing'"!="" generaterow, ///
>                 variable(`variable') binexp(`binexp')  ///
>                         condition(">=.") file(`file')
  6. 
. end

. 
. 
. 
. 
. 
. *************************
. *  Create table output  *
. *************************
. 
. 
. 
. cap file close tablecontent

. file open tablecontent using "output/basetable1_ar.txt", write text replace
(note: file output/basetable1_ar.txt not found)

. 
. 
. 
. /*  Open cohort and extract covariates  */
.         
. use "analysis/data_aranalysis_cohort1.dta", clear 
(Analysis dataset, wave 1 (1 Mar - 31 Aug 20), for absolute risk work)

. 
. * Complete case for ethnicity  
. drop if ethnicity_5>=.
(0 observations deleted)

. 
. * Keep adults 18-50 only
. keep if inrange(age, 18, 50)
(11,011 observations deleted)

. 
. 
. /* Table: Demographic variables  */
. 
. gen byte cons=1

. tabulatevariable, variable(cons) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  513
  12,183
  12,183

. file write tablecontent _n 

. 
. tabulatevariable, variable(agegroup) start(1) end(7) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  0
  12,183
  0
  513
  414
  12,183
  9,807
  513
  99
  12,183
  2,376
  513
  0
  12,183
  0
  513
  0
  12,183
  0
  513
  0
  12,183
  0
  513
  0
  12,183
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(male) start(0) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  271
  12,183
  6,239
  513
  242
  12,183
  5,944

. file write tablecontent _n 

. 
. tabulatevariable, variable(ethnicity_5) start(1) end(5) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  109
  12,183
  2,495
  513
  110
  12,183
  2,449
  513
  100
  12,183
  2,448
  513
  85
  12,183
  2,386
  513
  109
  12,183
  2,405

. file write tablecontent _n 

. 
. tabulatevariable, variable(region_7) start(1) end(7) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  48
  12,183
  1,186
  513
  102
  12,183
  2,465
  513
  144
  12,183
  3,716
  513
  112
  12,183
  2,442
  513
  60
  12,183
  1,174
  513
  47
  12,183
  1,200
  513
  0
  12,183
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(imd) start(1) end(5) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  207
  12,183
  4,914
  513
  0
  12,183
  0
  513
  197
  12,183
  4,839
  513
  109
  12,183
  2,430
  513
  0
  12,183
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(obesecat) start(1) end(5) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  22
  12,183
  307
  513
  200
  12,183
  4,613
  513
  95
  12,183
  2,263
  513
  90
  12,183
  2,215
  513
  106
  12,183
  2,785

. file write tablecontent _n 

. 
. tabulatevariable, variable(smoke_nomiss) start(1) end(3) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  436
  12,183
  10,434
  513
  11
  12,183
  240
  513
  66
  12,183
  1,509

. file write tablecontent _n 

. 
. 
. 
. /* Table: Comorbidities  */
. 
. tabulatevariable, variable(asthmacat) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  84
  12,183
  1,924

. file write tablecontent _n 

. tabulatevariable, variable(cf) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  114
  12,183
  2,360

. file write tablecontent _n 

. tabulatevariable, variable(respiratory) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  92
  12,183
  2,425

. file write tablecontent _n 

. tabulatevariable, variable(cardiac) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  94
  12,183
  2,397

. file write tablecontent _n 

. tabulatevariable, variable(af) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  87
  12,183
  2,463

. file write tablecontent _n 

. tabulatevariable, variable(dvt_pe) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  107
  12,183
  2,330

. file write tablecontent _n 

. tabulatevariable, variable(pad) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  182
  12,183
  4,329

. file write tablecontent _n 

. tabulatevariable, variable(diabcat) start(2) end(4) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  98
  12,183
  1,921
  513
  21
  12,183
  468
  513

** COUNT <=5 **
  12,183
  7

. file write tablecontent _n 

. tabulatevariable, variable(liver) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  97
  12,183
  2,396

. file write tablecontent _n 

. tabulatevariable, variable(stroke) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  86
  12,183
  2,398

. file write tablecontent _n 

. tabulatevariable, variable(tia) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  95
  12,183
  2,404

. file write tablecontent _n 

. tabulatevariable, variable(dementia) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  107
  12,183
  2,376

. file write tablecontent _n 

. tabulatevariable, variable(neuro) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  86
  12,183
  2,432

. file write tablecontent _n 

. tabulatevariable, variable(kidneyfn) start(2) end(3) file(tablecontent) binexp(coviddeath2_nocensor)
  513

** COUNT <=5 **
  12,183
  11
  513
  182
  12,183
  4,349

. file write tablecontent _n 

. tabulatevariable, variable(spleen) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  180
  12,183
  4,345

. file write tablecontent _n 

. tabulatevariable, variable(transplant) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  177
  12,183
  4,355

. file write tablecontent _n 

. tabulatevariable, variable(immunosuppression) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  89
  12,183
  2,471

. file write tablecontent _n 

. tabulatevariable, variable(cancerHaem) start(2) end(4) file(tablecontent) binexp(coviddeath2_nocensor)
  513

** COUNT <=5 **
  12,183
  50
  513
  8
  12,183
  198
  513
  83
  12,183
  2,200

. file write tablecontent _n 

. tabulatevariable, variable(cancerExhaem) start(2) end(4) file(tablecontent) binexp(coviddeath2_nocensor)
  513

** COUNT <=5 **
  12,183
  71
  513
  19
  12,183
  361
  513
  168
  12,183
  3,818

. file write tablecontent _n 

. tabulatevariable, variable(autoimmune) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  99
  12,183
  2,416

. file write tablecontent _n 

. tabulatevariable, variable(ibd) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  104
  12,183
  2,408

. file write tablecontent _n 

. tabulatevariable, variable(smi) start(1) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  105
  12,183
  2,358

. file write tablecontent _n 

. tabulatevariable, variable(ld) start(0) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  303
  12,183
  7,370
  513
  210
  12,183
  4,813

. file write tablecontent _n 

. tabulatevariable, variable(ds) start(0) end(1) file(tablecontent) binexp(coviddeath2_nocensor)
  513
  424
  12,183
  9,844
  513
  89
  12,183
  2,339

. file write tablecontent _n 

. 
. file close tablecontent

. 
. 
. * Close log
. log close
      name:  <unnamed>
       log:  C:\Users\emsuewil\Documents\Work\Covid\OpenSAFELY\Absolute_risks\absolute-risks-covid-research\logs/AR001b_tabulate_cohort
> _descriptives.log
  log type:  text
 closed on:  18 Feb 2021, 14:07:22
---------------------------------------------------------------------------------------------------------------------------------------
